[
    {
        "Job Title": "SHE Administrator",
        "Job Description": "SHE Administrator 6 Months Stevenage £16.50/hr PAYE + Holidays Inside IR35 Role Responsibilities • Attend weekly / monthly meetings. • Manage the SHE inbox • Issue Display Screen Equipment such as keyboards, mouse to end users. • To liaise with Safety Zone Managers (SZM’s), Facilities and other stakeholders across the business to follow up on: • Outstanding risk assessments and track to their completion • Allocate accidents to the appropriate person to investigate • Track open accident actions to completion • The Safety Zone monthly inspection checklists – helping the SZM’s to update these checklists, if required. • Raise Facilities related requests • Perform daily back office activities ensuring processes are maintained to help meet team deadlines. Typical Knowledge, Skills and Qualification Requirements • Work under pressure • Work independently with limited supervision • Have a strong knowledge of Microsoft Excel, Word & PowerPoint applications and • Have experience within a large organisation. Morson is acting as an employment business in relation to this vacancy. The candidate should be able to quickly adapt to the working environment and understand process and practices across the business. Administration; filing; e-filing; GDPR; secretarial; data entry; data input; Excel; Word; Outlook; Access; MS Office; booking system; business support; database management; diary management; minute taking; INDTNMI02",
        "Job Location": "Stevenage",
        "Gross Salary": "16 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-26",
        "Job Reference": "221954JMT",
        "Sector": "Office & Administration",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Jennifer MItchell",
        "Recruiter Email": "Jennifer.Mitchell@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/she-administrator-1"
    },
    {
        "Job Title": "Electrical Design Engineer",
        "Job Description": "Morson Talent are recruiting for an electrical design engineer for work in the Bideford area. The role will be a varied role, working on projects of varying sizes, conducting surveys and measurements of the ships to install, repair and service the Ship’s Electrical and Technical systems. You will produce accurate production drawings using AutoCAD (2D) for the Production team and detailed technical specifications of how to undergo the installation of new or modified systems. You will be required to attend meetings to provide the in-house technical support to installers. Responsibilities: Co-ordinate the activities with the systems discipline to produce the required engineering information to meet the needs of the business Producing accurate Production drawings Producing technical specifications for installation of new systems Liaising with Project staff, contract staff and Design team: Check output for accuracy and compliance with rules, regulations and quality standards Monitor progress against schedule and prepare progress reports Identify risks to schedule, cost or quality and assist to minimise impact Develop system philosophies, steel design, P&IDs valve and fittings lists, electrical line diagrams and cable specifications, block layouts, structural arrangements and sizes to authorities and project as appropriate Develop design documentation from concept to Regulatory Authority approval standards Liaise with internal departments, customers, regulatory bodies, suppliers and other design agencies Provide advice and guidance in area of discipline and to project and other department staff as necessary Specify equipment and components for requisitioning Assist with the preparation of tender budgets, schedules Provide offsite support to customers as practicable Prepare specifications and evaluate tender Manage subcontractor packages of work and subcontractors Seek and implement improvements in conjunction with other department staff Lead continuous improvements processes in own discipline Servicing and installation new or modified systems on ships Ability to produce accurate drawings Teamwork and communication skills Qualifications & Experience: HNC (minimum) in a relevant electrical discipline. Experience with AutoCAD 2D Electrical or Naval Engineering background ideal Problem solving skills Ability to analyse data Methodical and organised",
        "Job Location": "Devon",
        "Gross Salary": "36 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-26",
        "Job Reference": "221600SCR",
        "Sector": "Engineering",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Sharon Crick",
        "Recruiter Email": "sharon.crick@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/electrical-design-engineer-49"
    },
    {
        "Job Title": "CNC Machinist /5 Axis Operator",
        "Job Description": "Morson are recruiting exclusively for GKN Aerospace who require a CNC Machinist/ 5 Axis Operator at their site based in East Cowes, Isle of Wight . Our client GKN are a global company invested in shaping the future of flight and developing technologies to make aircraft fly further, faster, and greener. You could be part of this innovative business! Rates £16.34 then after 2 weeks it increases to £20.43. 12 months+ CONTRACT role. £1400 ACCOMODATION COSTS (Taxable) We will reimburse up to £1,400 per month to cover accommodation costs and one Ferry ticket per month up to £100. 08.00 to 16.30 Monday to Thursday and 07.45 to 12.45 Fridays then move to Double Days 06.00 to 14.00 week one and 14.00-to-22.00-week two rotating weekly. This position involves machining to stringent tolerances to meet the required specifications, as used in the tightly governed aerospace industry. In this role you will be responsible for the fixture and tool setting, including programme loading and operating controllers for various 5 Axis machining centres. Typical equipment to be operated will include 5 Axis machines so experience with this type of machine would be advantageous, although machine-specific training will be given to the successful candidates. Your main priority is to ensure that all aspects of the machining process conform to the required quality and health and safety standards. Desirable Requirements Applicants must be able to demonstrate the ability to consistently deliver a high standard of workmanship, ensuring customer requirements are met. Working as part of a close team, strong communication and organizational skills are required. Certified - be a time served apprentice machinist OR tool maker (NVQ 3 OR City & Guilds 2 OR 3 also suitable) IN0TNM102",
        "Job Location": "Isle of Wight",
        "Gross Salary": "20 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-26",
        "Job Reference": "219841CMN",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Carl  Mawson",
        "Recruiter Email": "Carl.Mawson@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/cnc-machinist-slash-5-axis-operator"
    },
    {
        "Job Title": "Software Engineer (SC Cleared)",
        "Job Description": "Software Engineer (SC cleared) 6 month contract Up to £70ph Inside IR35/Umbrella Role description / task: There is a refresh activity underway to update PFVC/DSM software. The software is being updated to use the CLCS software modified to interface to boat systems. We require software engineers who have experience using C# to interface to physical control systems over serial / IP networks. There is currently unmet demand in ARMS for 2 FTEs. Required Experience /Qualification /Attributes: • Understanding of and ability to perform Object-Oriented programming • Coding skills in C# • Experience with .NET framework and .NET Core • Experience with version management and control (for example git) • Knowledge of coding and software engineering best practices • Experience developing software that will be embedded into, and provide control over, complex control systems Desirable Experience /Qualification /Attributes: • Ability to conduct database design (using for example Entity Framework and entity models) • Coding skills in one or more of the following languages: C, C++, Java, VB or Python",
        "Job Location": "Bristol",
        "Gross Salary": "70 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "SC Clearance Required",
        "Posted Date": "2023-07-26",
        "Job Reference": "221957HED",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Hose Edin",
        "Recruiter Email": "Hose.Edin@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/software-engineer-sc-cleared"
    },
    {
        "Job Title": "Paint Sprayer",
        "Job Description": "Hi, Morson are proudly working alongside a leading Aerospace and Defence company in the search for a Paint Sprayer in Cambridge, Cambridgeshire. This is a contract role, initially for 6 months although permanent will be considered. Painter Rates: Days:  PAYE :  £18.56 per hour + £2.89  (Holiday Pay) = £21.45 per hour  / Umbrella : £27.22 Nights: PAYE : £22.42 per hour + £3.89 (Holiday pay) = £26.31 per hour / Umbrella : £30.52 Overtime: Overtime is available on an ad hoc basis. Mondays to Saturdays: Time and a half Sundays : Double time Painter Role Profile Whilst industry experience is desirable, experience will be considered on a case-by-case basis, meaning this is an amazing opportunity if you are wishing to start an excellent career in the Aerospace sector with a respected company. This is a great job for Paint Sprayers /Painters looking for something with a bit more variety, as there will be opportunities to travel on working parties in the UK and abroad. Painter Key Responsibilities: Supervision and guidance to other operators within the team, ensuring Paint and Quality standards are maintained. • Ensure all operators are working in line with Marshall Health and Safety management systems. • Take a proactive lead in continuous improvements to include lean and 5s procedures ensure a clean compliant work area is maintained at all times. • Ensure equipment and tooling required is available and maintained. • Attend and support production meetings. • Assist the Paint Shop Manager with paint shop performance and Key Performance Indicators. • Management of Paint shop staff in their daily duties. • Management of daily time sheets. • Ensure that history cards are completed at time of work. • Ensure high standards of housekeeping. • Requisitioning paint and materials for shop floor. • Completing on-line repair slips, for plant and tool maintenance. • Timely responses to inspection reports. • Highlight and manage abnormalities. • Implement and maintain department processes and systems. • Liaise with internal suppliers and customers to ensure compliance with programmes. • Audit spray booths to ensure that they are working at correct time and temperature If the painter role is of interest, please apply. INDTNMI02",
        "Job Location": "Cambridge",
        "Gross Salary": "26 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-26",
        "Job Reference": "215221JDE",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Joseph Denneny",
        "Recruiter Email": "Joe.Denneny@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/paint-sprayer-26"
    },
    {
        "Job Title": "Admin Assistant",
        "Job Description": "Our client, Scottish Power Energy Networks based in Prenton are looking for an Administrative Assistant to join their Outage planning team on a contract basis, initially for 5 months, but likely to be extended dependant on project needs. Outage Planning provides a customer notification service to all sections which will be affecting customers with planned shutdowns. This includes the raising of jobs in corporate systems, preparing lists of customers likely to be affected, notifying customers and utilities, managing changes to planned shutdown, liaising with customers over complaints Provide and excellent customer service in all activities Record shutdown information into their internal system and outage management databases Report on performance, productivity and process compliance as required Support other sections within SPEN as required in an emergency situation",
        "Job Location": "Wirral",
        "Gross Salary": "12 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "5 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-26",
        "Job Reference": "221956LME",
        "Sector": "Office & Administration",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Lisa Meikle",
        "Recruiter Email": "Lisa.Meikle@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/admin-assistant-22"
    },
    {
        "Job Title": "Data Engineer",
        "Job Description": "Data Engineer x 2, £450.00-£500.00 per day, Outside IR35, Primarily Remote, 2 months initial contract. My client, with a global presence in customer experience software, is looking for 2 highly skilled and motivated Data Engineers with a strong focus on AWS and native tools such as S3, Redshift, and SageMaker. The ideal candidate will have a deep understanding of data engineering principles, Python, SQL, ETL, and storage technologies. Additionally, proficiency in integrating with third-party services and experience with Elastic Search and Kibana will be highly valued. As a Data Engineer, you will play a crucial role in designing, implementing, and maintaining data pipelines and systems that enable efficient and accurate data processing, storage, and analysis. Key Responsibilities: 1. AWS Expertise: • Design, deploy, and maintain data solutions on the AWS platform, leveraging services like Amazon S3, Redshift, and SageMaker. • Optimize AWS infrastructure for performance, scalability, and cost efficiency. 2. Data Pipeline Development: • Develop robust ETL (Extract, Transform, Load) processes to handle large-scale data processing from various sources to target systems. • Ensure data pipelines are reliable, scalable, and adhere to best practices. 3. Data Storage and Management: • Implement and manage data storage solutions on AWS, including data warehousing, data lakes, and object storage using S3. • Work on data governance, security, and access controls to maintain data integrity and compliance. 4. Python and SQL Proficiency: • Utilize Python and SQL to build data processing scripts, perform data manipulation, and write efficient queries for data extraction. 5. Integration with 3rd Parties: • Collaborate with external partners and vendors to integrate data from third-party sources into the organizations data ecosystem. • Ensure seamless data flow between internal and external systems while maintaining data quality and consistency. 6. Elastic Search and Kibana: • Leverage Elastic Search and Kibana to build powerful search and visualization solutions for data analysis and monitoring. • Implement indexing strategies and optimize search performance. 7. Performance Optimization: • Monitor and troubleshoot data pipelines, identifying bottlenecks and areas for improvement. • Optimize database queries and infrastructure for maximum efficiency. 8. Data Quality and Validation: • Implement data validation and data quality checks to ensure the accuracy and reliability of data used for analysis and reporting. 9. Documentation and Collaboration: • Maintain detailed documentation of data processes, data flows, and system configurations. • Collaborate with cross-functional teams, including data scientists, analysts, and software engineers, to understand data requirements and provide data support. Qualifications and Skills: • Proven experience as a Data Engineer, with a focus on AWS and native tools like S3, Redshift, and SageMaker. • Strong programming skills in Python and proficiency in SQL for data manipulation and querying. • Experience with ETL processes and data integration from various sources. • Knowledge of data storage and management principles, data warehousing, and data lake architecture. • Familiarity with Elastic Search and Kibana for search and data visualization. • Understanding of cloud computing principles and AWS services. • Strong problem-solving and analytical abilities. • Excellent communication skills and the ability to work collaboratively in a team environment.",
        "Job Location": "Manchester",
        "Gross Salary": "500 PER DAY",
        "Payroll Status": "Outside iR35",
        "Location Type": "Remote",
        "Assignment Length": "2 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-26",
        "Job Reference": "221953BCO",
        "Sector": "IT",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Brendan Costello",
        "Recruiter Email": "Brendan.Costello@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/data-engineer-26"
    },
    {
        "Job Title": "Lead Planning, Monitoring & Control Professional (HYBRID)",
        "Job Description": "Title : Lead Project PM&C Professional Site : Barrow-in-Furness (LA14) MUST BE ABLE TO COMMUTE TO SITE Contract : 12 Months (chance of an extension) Rate : £47.00ph + £6.83ph Holiday pay/ £62.02ph Umbrella Working Model : HYBRID Role Description: The individual in this role will manage the PM&C processes of a small project, or a part of a larger, more complex project, (such as a particular work package), or will support a Project Manager or Head of Project with aspects of managing PM&C on a larger project. At this level the incumbent may lead a small team of professional staff (typically up to 5), being responsible for managing their delivery and performance and providing appraisal and support to their development. They will have a level of experience in one or more areas of PM&C practice and be expected to be able to adapt and apply these practices in different circumstances, to develop these practices and to guide and instruct others in their application. Core Duties: Able to perform advanced project reporting & scheduling. Able to undertake advanced problem solving typically based on previous experience. Have a comprehensive knowledge of Business process and procedures. Administration and general office skills including spreadsheets/ Microsoft packages. Attend on the job training as appropriate. Able to lead the PM&C processes on a small project or a work package of a larger project. Able to manage the PM&C processes on a full project lifecycle to ensure that, over time, the needs of customers/users continue to be met and that financial and other benefits are achieved. Identify, assesses and manages risks to the success of the project. Applies appropriate PM&C methods and tools whether predictive (plan-driven) approaches or adaptive (iterative/agile) approaches. Agrees PM&C approach with stakeholders, and prepares realistic plans (including quality, risk and communications plans) and tracks activities against the project schedule, managing stakeholder involvement as appropriate. Consolidate expertise from multiple sources, including third party experts, to provide coherent advice to further organisational objectives. Supports and promotes the development and sharing of specialist knowledge within the organisation. This is a role for an experienced project professional with a small team and the ability to deliver with limited guidance from the Line Manager. Leadership responsibilities: Accountable as a member of the PM&C team for supporting development and implementation of appropriately tailored PM&C practices. May have supervisory responsibilities for up to 5 staff. Expected to provide technical support to team members. Accountable for ensuring one or more aspects of PM&C practices in the project are suitable for purpose. Knowledge: Comprehensive knowledge and understanding of PM&C policies, processes, procedures and systems. Comprehensive PM&C experience demonstrated in a professional capacity and the specialist skills to ensure procedures are followed with the ability to define the standards which the others will operate. Guides others in application of PM&C processes. Comprehensive knowledge and understanding of their project. Comprehensive understanding of one or more PM&C tools techniques and practices. Comprehensive knowledge and understanding of the Business environment for their project. Good knowledge and experience of PM governance and assurance processes such as Integrated Baseline Reviews (IBRs). Typically an Assessor for LCM Reviews. Experience of influencing stakeholders both inside and outside the company. Comprehensive understanding of the wider PM&C environment, and of developments and practices in the field. Comprehensive understanding of own project/s, its markets, customers, strategic priorities and culture. Knowledge acquired through job related training and on the job experience with theoretical and practical skills. Experience of building relationships and negotiating outcomes with internal stakeholders. Gathers and analyses information. Supports development of solutions and of implementation approaches. Skills: Problem solving most likely to apply in an existing Business environment and also in a new Business environment. Good understanding of the structure, organisation, processes and culture of Line of Business, so as to be able to support implementation of appropriate PM&C approaches. Applies problem solving techniques to situations of moderate complexity in the field of PM&C, taking requirements and data from internal (project) sources and external (customer, competitor and academic) areas. An ability to gather information. Supports development of solutions and of implementation approaches. Ability to capture, adopt and share good practice. A comprehensive understanding of how team integrates with others teams & projects in order to achieve objectives. Work is typically within standardised processes and practices, accuracy of tasks is impactful. Direct impact on the performance of the team. Responsible for training members of the team, monitoring their quality of work and contributing to pay decisions Quality and timeliness of work reflects on the effectiveness of the immediate team. Business acumen that goes beyond immediate team. Make judgments, recommendations and advises on analysis of factual information. Impact in terms of providing services/information on matters that assist others in controlling or making decisions. Job involves regular exchange of information and handling of difficult conversations. Communication exchange can be complex and could involve sensitive information. Diplomacy skills required in order to work across business boundaries to achieve optimum solutions. Will need to participate in negotiations and influence operational managers primarily internally at all levels. Qualifications: Application of related PM Competencies will be expected at this level. Roles typically require a University Degree, or a substantial amount of practical knowledge gained through experience. Incumbent will be expected have a PM Qualification such as the APM Project Management Qualification. Core Duties The role holder: • Able to perform advanced project reporting & scheduling. • Able to undertake advanced problem solving typically based on previous experience. • Have a comprehensive knowledge of Business process and procedures. • Administration and general office skills including spreadsheets/ Microsoft packages. • Attend on the job training as appropriate. • Able to lead the PM&C processes on a small project or a work package of a larger project. • Able to manage the PM&C processes on a full project lifecycle to ensure that, over time, the needs of customers/users continue to be met and that financial and other benefits are achieved. • Identify, assesses and manages risks to the success of the project. Applies appropriate PM&C methods and tools whether predictive (plan-driven) approaches or adaptive (iterative/agile) approaches. Agrees PM&C approach with stakeholders, and prepares realistic plans (including quality, risk and communications plans) and tracks activities against the project schedule, managing stakeholder involvement as appropriate. • Consolidate expertise from multiple sources, including third party experts, to provide coherent advice to further organisational objectives. Supports and promotes the development and sharing of specialist knowledge within the organisation. • This is a role for an experienced project professional with a small team and the ability to deliver with limited guidance from the Line Manager. Leadership Responsibilities The role holder: • Accountable as a member of the PM&C team for supporting development and implementation of appropriately tailored PM&C practices. • May have supervisory responsibilities for up to 5 staff. • Expected to provide technical support to team members. • Accountable for ensuring one or more aspects of PM&C practices in the project are suitable for purpose. Budget Responsibilities The role holder: • No budget responsibilities would the expected at this level from a financial perspective, but there are likely to be time and resource constraints. Competencies Knowledge: • Comprehensive knowledge and understanding of PM&C policies, processes, procedures and systems. • Comprehensive PM&C experience demonstrated in a profession",
        "Job Location": "Barrow-in-Furness District",
        "Gross Salary": "62 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Hybrid",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-26",
        "Job Reference": "221922SAD",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Shoaib Ahmed",
        "Recruiter Email": "Shoaib.Ahmed@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/lead-planning-monitoring-and-control-professional-hybrid"
    },
    {
        "Job Title": "Senior Electrical Design Engineer",
        "Job Description": "Morson are currently recruiting Senior Electrical Design Managers across London for a 6 month contract required in office once or twice a week and to visit site occasionally as per project requirements. Overview of Role Reporting to the Principal Engineer, this is a role that will be responsible for the project design output of their engineering discipline, for managing the technical delivery of project and client technical oversite to meet budget, time-frame and quality targets, meeting or exceeding client expectations, promoting and marketing all facets of our clients services during interfaces with clients and other sectors and disciplines, contributing towards the achievement of the divisional business plan and building networks within the industry. There will be a number of projects that the Senior Electrical Design Engineer will work on at any one time this will involve disciplined self-management and management of others to ensure that all required outputs are achieved on time. The Senior Electrical Design Engineer may also have the opportunity of becoming a discipline technical lead or overall multi-disciplinary design lead on projects. The role is for engineers who have the capability and knowledge in electrical design, ideally with water or heavy industry experience and possessing the right attitude and aptitude for design work. The Senior Electrical Design Engineer will work in a multi-disciplinary design team environment and communicate effectively with the other design disciplines to ensure an effective overall design output. This role can also be a developmental role towards a Principal or Design Lead Engineer position. The overall responsibility of the Senior Electrical Design Engineer is to ensure successful execution and completion of design outputs for a number of projects, meeting defined timescales, milestones, and quality standards whilst meeting commercial objectives. This may also involve managing a disciplined or multidisciplined team and so relationship’s internal and external. The Senior Electrical Design Engineer shall embrace our clients behavioural framework. Minimum Academic and Professional Qualifications: • Degree in Electrical or Electronic l Engineering or similar e.g. Physics. • Chartered Engineer or commitment to working towards Chartered or Incorporated Engineer and a current member of a professional body.. Essential Experience: • Electrical Design or Project Engineering related experience ideally within the UK Water or Heavy Industry sectors. • Recent Design & Build experience working closely with civil contractors, process contractors and their supply chains. • Detailed knowledge of engineering and in particular their engineering design discipline (i.e. electrical). • Producing - SLD’s, Motor / Load / Instrumentation / Cable Schedules, Specifications for MCC’s / Transformers / Switchgear / Instrumentation / PLC Hardware etc., Electrical Calculations, Equipment layout and cable routing drawings, Design Risk Assessments. • Experience with Supplier and Sub-contractor liaison and management, MCC’s, Motor starting and protection, Harmonics, Power Factor Correction, Amtech, DSEAR / ATEX, Industrial Communications Networks, PLC / SCADA / DCS systems, Functional acceptance testing, Functional Safety. • Have a good understanding of the other engineering disciplines within the design team (i.e. process, mechanical, civil, structural and CAD). • Have a general understanding of project commercial issues and constraints. • Health, Safety and Environmental systems and procedures. • Understand the importance of and execution of change management. • Ability to plan and programme. Prioritise and allocate time according to priority. • To work independently and as a team member. • Good motivation, influencing and people management skills. • Knowledge, experience and responsibility for design management preferred. • Ability to think in an innovative and entrepreneurial manner. • Assess and mitigate design and other project risks. • Knowledge and experience of BIM led design and Autodesk suite of products. Desirable Experience: • Complementary technical skills including knowledge and experience of the design of Regulated Water and/or Water Environment sectors, covering water supply or wastewater infrastructure and non-infrastructure, reservoirs, canals and rivers.. Please send CVs to john.kingham@morson.com",
        "Job Location": "England",
        "Gross Salary": "60 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-26",
        "Job Reference": "221927JKM",
        "Sector": "Construction & Civil Engineering",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "John Kingham",
        "Recruiter Email": "john.kingham@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/senior-electrical-design-engineer-27"
    },
    {
        "Job Title": "Senior CS&A Technician",
        "Job Description": "Senior Structural Technician Bristol Role Summary You will form a leading role within a dynamic design team undertaking traditional, bespoke and innovative designs of reinforced concrete, steel and masonry structures for nuclear decommissioning and nuclear new build projects, as well as support to operating nuclear sites. The projects you undertake will principally be in relation to the design and detail of structures associated with state-of-the-art mechanical handling equipment and their process and electrical systems, but can also involve stand-alone civil/structural tasks for a range of sectors, for example structural inspections and site surveys, and will be undertaken primarily for sites across UK with some projects based internationally. You will provide technical guidance and support to projects and support and mentor other members of the CS&A team. Responsibilities: • Delivering Nuclear design work, inspections and construction site support on projects for a range of public and private sector clients within the UK and overseas. Work encompasses the full lifecycle of a project. • Supporting the preparation of the designs of structures and infrastructure of varying complexity, including production of relevant models and drawings using Autodesk products, particularly Revit and AutoCAD, throughout the various stages of the design process. • Working with integrated multi-disciplinary teams to deliver high profile projects. • Provide technical support to other members of the team. • Ensure all work to be carried out with a positive attitude toward safety, both in design and in the office environment. • Assisting and mentoring team members to promote their technical and professional development. • Support in the solution of problems of varying complexity that may arise during the design stage, fabrication, construction, installation, commissioning and decommissioning. • Accurately report on a periodic basis, specified by the Technical Lead on a project, the estimate to complete assigned tasks. • Responsible for ensuring, as far as possible, the correctness of their own work and for checking other relevant output. • Understand and support the process for developing and implementing BIM Level 2 compliant systems and processes. Qualification Requirements: • HNC qualified in Civil / Structural Engineering or an appropriate Engineering profession. • Working towards, or achieved, EngTech Member status with the ICE or IStructE. Experience Required: • Significant experience in the design and detailing of structures in reinforced concrete and steelwork. • It would be advantageous but not necessary to have previous experience within the nuclear industry. • Conversant with Autodesk products with a minimum of 2 years project experience on Revit and Navisworks. Location: • The base location for this role is Bristol Business Park, Bristol.",
        "Job Location": "Bristol",
        "Gross Salary": "45 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-26",
        "Job Reference": "221871ZB",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Zaida Bhana",
        "Recruiter Email": "zaida.bhana@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/senior-cs-and-a-technician-3"
    },
    {
        "Job Title": "Systems Engineer",
        "Job Description": "An exciting opportunity has arisen within Electronic Systems at Rochester for a Systems Engineer. The Systems Engineer will work as part of an integrated project team developing world-leading systems. As a Systems Engineer your main responsibilities will involve: Working in a team environment to develop systems that meet the complex and demanding requirements of our customers. These systems provide high-integrity solutions for our military and commercial products. As a Systems Engineer your skills and qualifications will ideally include a number of the following: • Knowledge of airborne and/or safety-critical products containing real-time embedded software • Knowledge and experience of requirements capture and management • System and/or equipment level design experience • Use of tools such as Matlab/Simulink, Enterprise Architect, DOORS • Use of modelling language SysML • Knowledge of electronics, optics or mechanics • System level verification activities • Hardware/Software integration and rig-testing skills • Problem solving skills Additional: Due to the sensitive nature of the product all applicants must have worked within the Defence / Military industry within the last 12 months or be capable of obtaining Security Clearance (SC level minimum). Rate negiotable through an Umbrella company or PAYE",
        "Job Location": "Rochester",
        "Gross Salary": "52 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221882STE",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Steve Roberts",
        "Recruiter Email": "Steve.Roberts@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/systems-engineer-223"
    },
    {
        "Job Title": "Validation Specialist contractor  (Laboratory)",
        "Job Description": "Job purpose To carry out all qualification, data integrity and CSV activities for laboratory equipment to ensure compliance with global cGMP, GAMP 5 and safety and environmental expectations and legal obligations. Principal accountabilities • To carry out all qualification, data integrity and CSV activities for laboratory equipment and systems. • Work to and deliver agreed Qualification plans that meet global cGMP expectations and align to the strategic direction of the site. • Knowledge of GAMP 5 for CSV and Data Integrity. • Resolution of deviations and issues associated with qualification activities and to support the resolution of deviations and issues that have a Qualification component. • Management: In consultation with Development, Compliance and Quality representatives (QA and QC), to formulate a strategy for the qualification requirements, based on previous experiences and cGMP expectations, company policy, guidelines (inc. GAMP 5) and procedures and the needs of the particular system. • To ensure that qualification protocols and reports are aligned to latest thinking on delivery of compliant qualification, including data integrity and CSV/CSA. Execution of protocols and report approvals. • To perform risk assessments related to qualification activities. • To take on any other duties which are within the employee’s skills and abilities whenever reasonably instructed. Scope • To liaise with all departments necessary for delivery of the job purpose. Close liaison is required between Quality Control, Development and Quality Assurance Department. • To write, execute and report on all project qualification activities. • Support: To support product investigations associated with deviations or customer complaints, including identification of root cause, if qualification activities are involved. To support the identification of appropriate resulting CAPAs. • Support: To support and assist in the development and maintenance of the site quality system meeting the requirements of ICHQ7 and other relevant global requirements. • To support the organisation and implementation of the internal quality audit process and to assist in a programme of internal audits to ensure compliance with cGMP. INDTNMI04",
        "Job Location": "Edinburgh",
        "Gross Salary": "60 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221904MPY",
        "Sector": "Science, Biotech & Pharmaceuticals",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Mark Pritty",
        "Recruiter Email": "Mark.Pritty@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/validation-specialist-contractor-laboratory"
    },
    {
        "Job Title": "Commercial Manager",
        "Job Description": "Morson are currently recruiting for a Commercial Manager based at The London Stadium, Queen Elizabeth Park, London for a 6 month contract. Summary of Role Reports to Project Manager and (Sector / Project / Senior) Commercial (Manager / Director). Main responsibility- • Lead the commercial function on the project or within the sector for which they are responsible. • Ensure the timely provision of accurate commercial reports and data to the business. • Pursue own professional development and provide guidance and support to develop other commercial staff Ensure compliance and adherence of the project or sector team with the processes and procedures of our client. Specific Tasks and Responsibilities • Develop a good understanding of the wider aspects of Health, Safety and Environmental law affecting a Facilities business. • Have a full understanding of contracts and project delivery to ensure the very best commercial outcomes for the projects on which you work. • Ensure the implementation of the requirements of our clients Health Safety, Quality and Environmental procedures and conduct all duties in a manner consistent with these. • Highly competent in the application of IT skills to financial problems and the production of project documentation. • Maintain a wide knowledge of business systems to manage and present business information • Make best use of knowledge management systems • Use the CAFM platform to demonstrate our value to our clients. • Share best practice and knowledge of using the IT platforms with the wider Commercial/Project team. • Act upon the Management Information available from our IT records to drive commercial improvement through the project. • Develop awareness of wider our clients business plan objectives • Develop awareness of our clients resources and capabilities available to assist Customers regarding the delivery of new opportunities • Provide input and assist Divisional and Winning work teams to develop proposals to secure new opportunities • Develop an understanding of the wider finance and property issues that may affect the Facilities business. • Promote knowledge share and learning to develop an innovative team philosophy • Be a lean management champion and constantly drive the project teams to look for better ways of delivering the service. • Identify, manage, reduce and drive out unnecessary costs and inefficient activities • Maximise cash flow through timely preparation of valuations, submission of invoices and receipt of payment • Maintain a high level understanding of planning and programming to ensure accurate progress reporting • Work with supply chain to promote and measure continuous improvement in terms of cost, quality and learning of all parties • Anticipate and plans change in commercial resource within a project • Establish and maintain accurate and robust reporting structures and monitor resources and costs to ensure that projects meet and / or exceed targets • Develop comprehensive understanding of financial models including cashflow turnover forecasts and project profit / loss statements • Demonstrates and maintains a high level of commercial and technical knowledge and works closely with the delivery team to review techniques and solutions to meet business and customer needs • Ensure that our clients commercial position is protected using in depth understanding and experience of contractual, commercial, insurance and legal processes • Early identification of business risks in projects and ensuring that risk management, risk registers and contingency are in place to manage a minimise risk • Manage prompt preparation and settlement of final accounts. • Ensuring that all materials and suppliers are procured in an efficient manner with capable organisations in accordance with our clients procurement policy and procedures and ensure appropriate records are kept. • Comprehensive understanding of the requirements of the our clients quality policy and procedures and how these are applied to individuals own role. • Ability to develop new ideas and developing it into a different approach • Establish our clients commercial processes and procedures on projects in order to maximise returns in terms of profit and service level • Close out project efficiently using a high degree of understanding and working knowledge of project close out processes • Takes responsibility for management of commercial resources • Establish meaningful goals and objectives • Identify and develop the maximum potential of the commercial team • Have a full understanding of TUPE and pension regulations and their impact on our business. • Have a clear understanding of the issues associated with managing and running labour intensive projects. • Have measures and benchmarks in place to understand productivity and outputs from our teams. • Delegate responsibility to lowest appropriate level • Builds network of contacts throughout our client • Actively researches issues to identify alternatives actions and implements optimum solution • Makes decision based on sound research • Maintain and extend relationships and contacts with customers and consultants to identify new potential business opportunities and feed back to the Business Development team • Identify customer key drivers and determine optimum commercial approach that will bring mutual benefits to our client and the customer • Take a key role in negotiations with internal and external customers in developing and achieving mutually satisfactory outcomes • Communicates accurately, concisely and in a timely manner, whilst demonstrating effective listening • Able to communicate effectively to suit different audiences • Uses wider business systems to produce accurate reports • Undertakes the chairing and/or participation in Meetings in an effective manner Please send CVs to john.kingham@morson.com",
        "Job Location": "England",
        "Gross Salary": "500 PER DAY",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221901JKM",
        "Sector": "Construction & Civil Engineering",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "John Kingham",
        "Recruiter Email": "john.kingham@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/commercial-manager-145"
    },
    {
        "Job Title": "Sub contracts Manager Bids",
        "Job Description": "A fantastic opportunity has arisen for a Sub Contracts Manager with Bid experience to join the team with our prestigious client BAE Systems at their site in Guildford Role summary This role will be expected to lead and manage the procurement activity for strategic bids/projects in support of business winning within the C5ISR International team. It is expected that a Procurement Manager will involve driving procurement solutions, requiring the job holder to plan, deliver and deploy appropriate procurement supply chain interventions and resource in support of business aims. The candidate will support and develop category management to provide the business with year on year cost reduction, competitive advantage and/or value creation by proactively providing partnerships, agreements, frameworks and Strategic Relationship Management (SRM) and contribute to the delivery of the functional and line of business IBP. The candidate will be required to travel to our sites (Christchurch & Guildford) for 2-3 days every other week so ideally reside close to these locations. What you’ll be doing • As part of Procurement Business Winning Team ensure the Procurement strategies are being enacted through major bids and campaigns to support business winning and growth. Manage subcontract activities in conjunction with Commercial, project and technical teams including: subcontract construct contract negotiation and, contract implementation, ensuring robust handshake to the Procurement Delivery Team as appropriate for ongoing through-life or in-contract delivery. • Develop and implement supplier and third party bid winning/support strategy ensuring that critical supplier relationships are cultivated, developed and maintained so as to allow the business to fully meet customer current and future needs. • Manage and influence internal and external stakeholder relationships to ensure the Procurement bid service provision: o Meets the governance requirements of the business and our customers. o Provides competitive advantage by applying market knowledge and commercial acumen to drive value and innovation, decrease risk and support CSR targets through the supply chain. o Use relationships, business agreements and ethical trading knowledge to influence and drive the supply chain to add value o Manage flow down of terms from Customer contract to the supply chain in order to protect BAE Systems’ position. o Drives a continuous improvement philosophy through the supply chain o Achieves the required service level as agreed with internal stakeholders. • Consults with the business to understand their current and future demands and improve governance on future demand and S&OP planning, ensuring category management and sourcing strategies are fully aligned to such. • Maintains effective communications and develop appropriate relationships with internal and external stakeholders and become an advocate for Procurement. What we’re looking for This role requires: • Knowledge of Defence Procurement and technical awareness and market knowledge in the Defence domain an advantage • A solid procurement background and a good understanding of complex technical IT programmes, consulting, software product development and cyber security solutions • Previous Procurement and Subcontract experience in an IT environment, electronics and/or managed services establishing and managing subcontracts in large (> £50M) prime contractor project • Leading large bids from a procurement perspective • A high standard of Procurement competence in key areas of sourcing, process knowledge, contracting skills and supplier management excellent project management skills, product awareness, commercial acumen, financial awareness, risk and opportunity management • Experience of stablishing and managing overseas export subcontract partners. • Financial management experience of complex subcontracts. • The ability to deliver tangible project savings in a challenging environments • Ability to forge strong working relationships with peers and other colleagues. • Strong IT skills and a high level of communication skills • Ability to liaise and influence key Stakeholders. • Good degree in relevant subject. • CIPS L5 qualification, IACCM or equivalent standard. Recognising the restricted nature of the work  there is a requirement for the candidate to be eligible to obtain Security Clearance for this role. INDTNMI02",
        "Job Location": "Guildford",
        "Gross Salary": "505 PER DAY",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221894JMM",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Janet Mottram",
        "Recruiter Email": "Janet.Mottram@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/sub-contracts-manager-bids"
    },
    {
        "Job Title": "Project Manager",
        "Job Description": "We have an exciting new opportunity for a PROJECT MANAGER based in West Cumbria: About the Role: Project Managing the delivery of an active plant modification on Sellafield site. Task scope includes multi-discipline design, procurement, permissioning (INSA, MSC, PMP, etc.), implementation and close-out. The PM will be accountable for the creation of and delivery to a schedule that meets the expectations of the Customer’s Return to Service date, noting that this is a high priority fast-tracked task. Headline Experience and Expectations: Sellafield site experience. Project management of active plant modifications. Essential Skills and Experience: Familiarity with Sellafield Ltd processes, procedures and organisation Schedule production and monitoring. Cost control and reporting. Stakeholder management. Knowledge of the PMP process (this is potentially a Cat B PMP), INSA, MSC. Preferred Skills and Experience: Monitored worker Technical / engineering background APM qualifications",
        "Job Location": "England",
        "Gross Salary": "70 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221899GJA",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Gillian James",
        "Recruiter Email": "Gillian.James@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/project-manager-735"
    },
    {
        "Job Title": "Circuit Card Testing Engineer (Flying Probe)",
        "Job Description": "Our client manufactures world leading defence equipment and they are currently recruiting for a candidate with prior circuit card testing expertise. Role involves development of circuit card assemblies particular focus on flying probe (in-circuit testing) for circuit card assemblies. *Client has stated hybrid working a possibility but candidate would be needed for 3 days on site* **Recognising the RESTRICTED nature of the work suitable candidates will be SC clearable or eligible for this level of clearance, SC must be in place before start date is agreed** Duties: Creation of flying probe test packages for flying probe (in-circuit testing) of component and net-level defects on circuit card assemblies Creation of flying probe test programs from circuit card assembly data pack Debug of flying probe test package to establish suitable test method and limits Creation of manufacturing test documentation, including test specifications, proving reports, and compliance matrices Publishing test documentation using company Product-Lifecycle Management tool Provide technical support on flying probe and in-circuit testing to production test engineers and manufacturing. Support activities to include: Assessing production issues with test programs raised via problem reports Action change management to test programs using change notices Act as point of technical knowledge on in-circuit testing issues that arise in a production environment Undertake test coverage analysis of circuit card designs to establish a test strategy and make Design-for-Testability recommendations to product design engineers Skills / Experience / Requirements: Prior experience of flying probe test package development, with preference for experience developing on SPEA Flying Probe Test Systems HNC/HND (Electronics) Level of Qualifications or equivalent Experience in electronics manufacture and test Extensive digital and analogue electronics manufacturing and test experience A good understand of measurement and test principles, and equipment, with particular emphasis on in-circuit testing Good Planning and Organising skills Analytical and problem solving skills Attention to detail INDTNMI02",
        "Job Location": "Bolton",
        "Gross Salary": "35 PER HOUR",
        "Payroll Status": "Outside iR35",
        "Location Type": "Hybrid",
        "Assignment Length": "18 months",
        "Security Clearance Status": "SC Clearance Required",
        "Posted Date": "2023-07-25",
        "Job Reference": "217628TCR",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Tom Critch",
        "Recruiter Email": "Tom.Critch@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/circuit-card-testing-engineer-flying-probe"
    },
    {
        "Job Title": "Employee Relations Specialist",
        "Job Description": "Employee Relations Specialist: Crawley – Hybrid working; 6month contract; £300 per day Umbrella; Inside IR35 As Employee Relations (ER) Specialist, you’ll provide expert and pragmatic advice on the majority of ER issues, ensuring compliance with internal company policies and current legislative requirements. The role is critical to ensuring fair and consistent application of policy and process through the provision of accurate and timely advice to employees, managers and the wider HR function - either remotely or in person. The role is intended to support a variety of complex ER casework across all parts of the business in the UK, and will be the first point of escalation for ER Advisors. It is critical in the delivery of HR strategy in collaboration with Heads of HR and HR Directors through effective implementation of business change that has an impact on people e.g. restructuring, reorganisation, acquisitions, TUPE. Adopting a consultative approach with employees and managers, the role is expected to build strong relationships across the business and wider HR function, including trade union representatives and senior managers. You will Work with Lead ER Specialists to identify patterns / trends in the ER casework that may require review or changes to current policies and procedures, or training interventions, and lead the implementation of these. Work collaboratively with other members of the ER Team to ensure a seamless handover of cases where necessary, ensuring the customer is kept informed of progress at all times About You You’ll be excited to develop your Employee Relations Career. Excellent knowledge of current UK employment legislation and ACAS guidelines, plus proactive maintenance of this knowledge, working towards your CIPD qualification or already qualified is essential. Skills, knowledge and behaviours you will bring: Previous experience of implementing and advising on a broad spectrum of HR policies with managers and employees Experience of dealing with a variety of challenging ER cases, maintaining resilience with a pragmatic and positive approach Confident and able to employees, both face-to-face and over the phone, showing compassion and empathy Ability to build positive working relationships and establish Previous experience of working with external suppliers and fostering positive relationships that are professional and constructive Actively listens and explores the root cause of queries from managers and employees, constructively challenging as necessary Excellent written and verbal communication skills Strong attention to detail to work on own initiative and manage own time Team orientated, flexible and enthusiastic with a can-do approach. Prior experience of working in a complex/matrix engineering or technical organisation Design and deliver ER training Flexibility to work within different regions Experience of dealing with a variety of challenging ER cases, maintaining resilience with a pragmatic and positive approach Confident and able to employees, both face-to-face and over the phone, showing compassion and empathy Ability to build positive working relationships and establish Previous experience of working with external suppliers and fostering positive relationships that are professional and constructive Actively listens and explores the root cause of queries from managers and employees, constructively challenging as necessary Excellent written and verbal communication skills Strong attention to detail Ability to work on own initiative and manage own time Team orientated, flexible and enthusiastic with a can-do approach. Prior experience of working in a complex/matrix engineering or technical organisation Morson is acting an employment business in relation to this vacancy. INDTNMI02 Human Resources; HRBP; CIPD; HR Generalist; ER; Employment Relations; Employee Relations; Employer Relations; Coaching; Resource Planning; Trade Unions; Stakeholder management; People development; Talent Management; Succession Planning; HR Policies; Change Management; Mediation; HR Advisor; HR Specialist; Employment Law; People Management; Learning and Development; Capability Development; Early Careers",
        "Job Location": "Crawley",
        "Gross Salary": "300 PER DAY",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Hybrid",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "188269VH",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Vanessa Farrington",
        "Recruiter Email": "Vanessa.Farrington@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/employee-relations-specialist-15"
    },
    {
        "Job Title": "Senior Engineer",
        "Job Description": "We have an exciting new opportunity for a SENIOR MECHANICAL ENGINEER based in Warrington: About the Role: Development of mechanical engineering deliverable programmes, work packages and strategies for Study delivery. Production and support to task specifications for any external mechanical engineering requirements and the integration of those requirements into Study delivery. Development of Study scenario / optioneering lists. Production and checking of mechanical engineering deliverables and work packages (includes producing and checking of, but not limited to, reports / calculations etc) within Studies. Identifying and engaging with appropriate CoE’s/SME’s or any other specialist groups within SL in a timely manner to support study deliverable needs. Ensuring that governance and assurance is applied where necessary to mechanical deliverables. Ensuring performance, reporting and planned actions are effectively managed and communicated. Providing, where required, Line manager duties for supervision and performance of the engineering teams. Identifying any mechanical resource requirements to support their Study delivery requirements -Ensuring LFE and Best Practice are shared with other Study teams and are embedded in Study work. Timely engagement with mechanical stakeholders. Providing mechanical oversight for Study work packages within the Study worklist as required. Essential Experience and Qualifications: Suitable experience and track record in performing all of the above tasks in the role description. An open mindset and experience of producing and developing optioneering / building scenarios within Studies. Provision of engineering justification to underpin scenarios and allow informed preferred way forward selections to be made. Effective Stakeholder Management and communication skills. Proactive and able to identify and offer solutions to any issues that may arise within the mechanical Study delivery requirements. Experience of leading a team, including guiding junior engineers, through deliverable production. Knowledge and use of CAD and Inventor would be useful to Studies. Track record of delivering to time, cost and quality. Desirable Experience and Qualifications: Experience of the following would be valuable to the study team: Waste management techniques (handling, storage, treatment, transport). Management of special nuclear materials. Value management. Requirements management. Waste Retrieval and active area POCO. Active area decommissioning. Spent Fuel Management (Transport and Storage).",
        "Job Location": "Warrington",
        "Gross Salary": "55 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221884GJA",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Gillian James",
        "Recruiter Email": "Gillian.James@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/senior-engineer-39"
    },
    {
        "Job Title": "Apprenticeship served Mechanical Maintenance Technician",
        "Job Description": "Our client, a world leading manufacturer in weapons equipment, is looking for an apprentice served Mechanical Maintenance Technician. The role will be responsible for carrying out manufacturing, test and inspection tasks within the Live Build Facility at the clients site in Henlow, in accordance with product certification procedures, allocated budgets and timescales to meet project objectives Suitable candidates MUST hold time served apprenticeship, any candidates without apprenticeship WILL NOT be considered *Recognising the RESTRICTED nature of the work suitable candidates will be SC clearable or eligible for this level of clearance, SC must be in place before start date is agreed* Role Overview: The position will involve certifying the product and the individual will possess a versatile skill base with a capability to apply their skills across a range of tasks utilising equipment and tools, gauges and measuring instruments associated with the production, repair and modification of company products to meet defined build standards and specification requirements. Instructions associated with the task to be carried out would normally be documented by Engineering and take the form of Layouts, Schedules and Test Specifications. Equally these requirements may also take the form of a limited documentation set. Duties: Be fully conversant with all equipment, tools and measuring instruments associated with the manufacturing cycle Certify the product in line with the product certification procedure Maintain product certification and approval via regular audits Ensure manufacturing build, inspection and where relevant, test times are met Check and complete all paperwork associated with the manufacturing data pack Maintain to the highest level, workmanship standards and product quality Ensure compliance with all associated procedures applicable to the manufacturing process Maintain a safe working environment Maintain a good housekeeping policy Role requirements (skills, training and qualifications): MUST have formal technical engineering/craft apprenticeship Experience in a Manufacturing / Craftsman position Any previous experience with explosives or live weaponry would be highly beneficial Any previous Inspection experience would be highly beneficial Full live build safety training will be given to the successful candidate INDTNMI02",
        "Job Location": "Henlow",
        "Gross Salary": "29 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "SC Clearance Required",
        "Posted Date": "2023-07-25",
        "Job Reference": "217621TCR",
        "Sector": "Manufacturing & Utilities",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Tom Critch",
        "Recruiter Email": "Tom.Critch@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/apprenticeship-served-mechanical-maintenance-technician"
    },
    {
        "Job Title": "Principal Engineer - Software",
        "Job Description": "Principal Engineer – Systems and Software Location: Barrow, Remote working with 1 or 2 days a month on site Rate: £41.87 P/H PAYE + Holiday Pay or £55.25 p/h Umbrella Duration: 12 Months As a Principal Engineer - Systems Engineering (including Software) you will be working in a sub systems engineering team, helping us to design, develop, integrate, manage, and support control systems for in-service/future submarines. You will have a good understanding of the inputs, flow of decisions and dependencies that will impact system design as well as product delivery. As we move towards a model-based approach to Engineering, our Systems Engineers will continue to develop a wide-range of skills and experience across all areas and disciplines, and we are able to offer real opportunities for personal and team development to ensure that the professional capability of the business and individual are maintained and improved. Responsibilities • Integrating systems containing electronic, mechanical and software sub-systems, understanding the potential impact on the whole boat and interfacing systems • Oversee the Software development and transition through the development lifecycle. • Support the functional requirements from functional design to system design and Implementation including management of change and updates. • Ensure software processes and plans are valid, available, and maintained throughout the functional software lifecycle. • Support, Develop and facilitate the transition of the Software delivery process. • Apply your software knowledge to testing, certification and configuration control activities. • Compilation, Review and supporting the production of Software design evidence as required. • Providing guidance and coaching to other engineers • Working with customers to support delivered systems and resolve issues. Key skills, toolsets, and knowledge • Demonstrable knowledge of the system engineering and software development lifecycles • Demonstrable experience and knowledge working with software development in complex systems. • Understanding of relevant engineering standards, including safety and environmental regulations Appreciation and knowledge of Defence Standards and Industry standards IEC 61508 / 61511, Desirable ARP 4754, DO-178C, / DO-254. INDTNMI02",
        "Job Location": "Barrow-in-Furness District",
        "Gross Salary": "55 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Remote",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "220178DFA",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Daniel Farrow",
        "Recruiter Email": "Daniel.Farrow@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/principal-engineer-software-5"
    },
    {
        "Job Title": "Systems Engineer",
        "Job Description": "Job Overview Our Client has an immediate requirement for a Senior Systems Engineer to support the development and maintenance of the Integration Support Environment at the Maritime Integration & Support Centre (MISC) at Portsdown Technology Park, Portsmouth. Job Description: This role will provide you with a varied and interesting workload; every day will provide a different challenge. You will get to use various technologies across projects that will vary in lifecycle for a multitude of applications, working in dynamic and flexible team A unique opportunity to develop new tools and utilities, whilst also maintaining existing tool sets Production and maintenance of Systems Engineering documentation such as requirements, design, test plans & acceptance reports Organising and running small-scale system test & acceptance events Skills and experiences: Essential: A degree in a relevant subject e.g. Engineering, Computer Science, Maths or other equivalent qualification Experience of full systems engineering lifecycle (V Model, CADMID etc.) Good understanding of producing regulatory documentation Basic understanding of IP networks (protocols, switching & routing) The Tools and Technology Team: As part of this role you will support the development and maintenance of the Integration, Test and Analysis toolset for the Naval Ships Combat Systems (NSCS) Maritime Integration Support Centre (MISC) located at Portsdown Technology Park. This role provides an opportunity to design and integrate leading edge developments in a complicated systems-of-systems environment, interacting with a variety of stakeholders at various levels from the senior engineering community to peers in management positions through to customers. To apply for this position, you must be eligible to live and work in the UK and either possess or be able to obtain UK MOD Security Clearance to SC Level. INDTNMI02",
        "Job Location": "Portsmouth",
        "Gross Salary": "51 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221816CF",
        "Sector": "Defence, Military & Armed Forces",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Morson Rosyth",
        "Recruiter Email": "rosyth@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/systems-engineer-222"
    },
    {
        "Job Title": "Interim Accountant",
        "Job Description": "Job Title: Interim Accountant Salary: £350 p/day inside IR35 (6 Months) Location: Manchester/Hybrid We are now looking for an Interim Accountant to join our client on a 6-month contract. The Interim Accountant will support the provision of an effective financial & management accounting function. The Interim Accountant will also be expected to partner with relevant business areas, provide specialist advice, and identify opportunities for improvement to services, processes, and procedures. Key Responsibilities: • Implement accounting protocols for expenditure control. • Provide timely financial information and reports. • Support financial management of projects and workstreams. • Produce organizational and financial monitoring reports. • Assist in banking platform management and cash strategy. • Maintain financial systems and processes efficiently. • Manage budget framework for the business and directorates. • Monitor financial information for evaluation. • Support budget holders and decision-making. • Produce compliant financial and management accounting information. • Partner with relevant areas, offering expert advice to support decision-making. • Extract and analyse complex data for management decision-making. • Develop policies and systems aligned with strategic objectives. • Build and maintain trusted relationships with stakeholders. • Manage financial resources within assigned budgets. Experience/Skills required: • Degree in a relevant subject or equivalent experience. • Qualified or Part-Qualified (CIPFA, CIMA, ACA, ACCA) • Experienced providing financial management support in a customer-focused organizations. • Experience of developing and implementing financial processes, systems, and reporting mechanisms. • Experience and understanding of public sector finance. • Effective communication, negotiation, collaboration, and influencing skills. • Excellent communication skills, engaging diverse audiences. • Ability to translate technical concepts and provide specialist guidance. • Strong analytical skills in relevant specialist area. • Up-to-date knowledge of external issues affecting the specialist area. Kindly note that only shortlisted candidates will be contacted for an initial telephone interview. If selected, a formal interview process will follow.",
        "Job Location": "Manchester",
        "Gross Salary": "350 PER DAY",
        "Payroll Status": "Inside iR35",
        "Location Type": "Hybrid",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221875JC3",
        "Sector": "Banking, Financial Services & Accounting",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Jamal Crawford",
        "Recruiter Email": "Jamal.Crawford@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/interim-accountant-3"
    },
    {
        "Job Title": "Principal Systems Engineer",
        "Job Description": "Principal Systems Engineer Location: Luton Duration: 6 Months Rate: up to £60 p/h Umbrella This role will focus on the development of Airborne RF Electronic Warfare (EW) sub-system products to be integrated within a larger EW system architecture. The role entails applying knowledge and experience of systems engineering to support the design and development of this system. A role within the Combat Air Systems Engineering team will provide exposure to a wide-variety of EW products and subject-matter experts with expertise within domain, product, and technology fields. Job Responsibilities • Define system requirements and influence architectures for an advanced EW RF sub-system, in particular focussing on the processor sub-system providing command and control of other functional sub-systems. • Ownership of a sub-system work package, planning and scheduling your own workload. • Develop and document detailed requirement and design specifications suitable to inform and guide the systems implementation teams. • Contribute to the product development roadmap in collaboration with other subject matter experts. • Provide technical advice and support to other functional teams such as firmware and software with development of requirements, system operability and test & evaluation. • Produce and collate evidence to demonstrate system compliance with design and requirements specifications. • Provide domain expertise in support of both internal and external design reviews via written and verbal means. • Travel within the UK to meet with our customers and industry partners to support requirements collaboration, experimentation and reviews of design maturity. Key Skillset • A solid foundation in a relevant technical domain exploited in an EW systems context/application. • High proficiency in requirements generation and management using IBM DOORS. • Experience of authoring detailed design artefacts in support of requirements specifications. • Good understanding of design compliance and acceptance criteria relating to requirements and architecture progressive verification and validation at varying stages of maturity. • Strong understanding of systems engineering principles across the development lifecycle. • Previous experience of technical leadership of complex products. • Ability to perform effective interface control management, both in terms of application and derivation, at a sub-system, system and system-of-system levels including the generation of interface control documents. • Self-motivated with an aptitude for problem solving and driving challenging issues to a conclusion alongside excellent written, verbal, and presentation skills. • Ability to obtain SC Clearance for UK-caveated programmes. Desirable: • Knowledge of systems modelling using Matlab & Simulink. • Knowledge of product design and test standards for military systems. • Proven ability in the design of adaptable, flexible and secure system architectures. • Proven ability in signal processing engineering. • Knowledge and application of the software development lifecycle. • Awareness of agile development methodologies. Additional information Due to the sensitive nature of the product all applicants must have worked within the Defence / Military industry within the last 12 months or be capable of obtaining Security Clearance (SC level minimum). INDTNMI02",
        "Job Location": "Luton",
        "Gross Salary": "60 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "SC Clearance Required",
        "Posted Date": "2023-07-25",
        "Job Reference": "221867DFA",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Daniel Farrow",
        "Recruiter Email": "Daniel.Farrow@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/principal-systems-engineer-37"
    },
    {
        "Job Title": "Principal Systems Engineer",
        "Job Description": "Principal Systems Engineer Location: Luton Duration: 12 Months Rate: Up to £64.81 p/h Umbrella Systems Engineering activities associated with the delivery of Mission Data Generators (MDGs) and Mission Analysis Tools (MATs) to Integrated Mission Solutions (IMS) and Surveillance and Protection Technologies (S&PT) Customers. MDGs are PC based software tools that allow the end-user to produce Mission Data Sets (MDS), also known and Pre-Flight Messages (PFMs). MATs are PC based software tools that allow the end-user to analyse data recorded from ground or air based trials and operational sorties, in order to determine whether the MDS performed as expected, or whether changes to the MDS are required. A systems engineering contractor is required to support the development of new software functionality, in the form of requirements engineering and testing of new functionality, which can be integrated into the MDG and MAT baselines. The systems contractor would start by getting involved in the SEER 400 MAT Engineering release (ID 15031). This would then give them a good grounding to pick up the following Work Items in Azure DevOps: SEER 400 - Update Requirements Verification (ID 14939) SEER 400 - Documentation for Delivery of formal release (ID 14690) SEER 400 MDG - Complete testing or formal build (ID 14691) SEER 400 MA - Complete testing for formal build (ID 14748) The contractor would then pick up systems engineering work across the following, but not limited to, S&PT Projects including SEER 150, MAPPS, Shadow, Wedgetail, Nightjar, Redshank. Selection and Prioritisation from the IMS Products backlog captured in Azure DevOps. Attend both internal and external customer meetings to define requirements from the backlog. Backlog tasks include but not limited to:- Development / Enhancement of Interfaces between the toolsets Enhancements of reports Enhancement to existing functionality Addressing bugs Implementation of Requirements Writing of requirements and tests for the selected items from customer requirements. This shall be defined in Azure DevOps Work Items and these shall be added to a Sprint for completion. Customer End of Sprint Demo and Reviews Complete all Azure DevOps work items, which are required for the customer end of sprint demos and reviews. Definition of Acceptance Tests Writing of customer acceptance tests, including re-work. INDTNMI02",
        "Job Location": "Luton",
        "Gross Salary": "64 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221866DFA",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Daniel Farrow",
        "Recruiter Email": "Daniel.Farrow@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/principal-systems-engineer-36"
    },
    {
        "Job Title": "Principal Systems Engineer",
        "Job Description": "Systems Engineer Pay Rate: £70 - £80 p/h Ltd, Outside IR35 Location: Southampton based, 2-3 days on site Duration: 6 Months SC Clearance Required. In this role you will be required to design robust engineering solutions taking into account all relevant requirements, working within the agreed budget and schedule constraints. You will be required to make technical decisions within your own sphere of influence. You will undertake various tasks within an Integrated Project Team, including: • Capture stakeholder and system requirements • Allocate the system level requirements to sub-systems based on the system architecture. • Show traceability and establish verification methods of systems engineering requirements. • Support the implementation of system level requirements. • Adherence to Leonardos Engineering governance e.g., policy, framework processes, design reviews • Provide systems engineering support to investigation and definition of RF/Communication system architectures/protocols for inclusion in project bids. Continue design and development of such architectures/protocols throughout the project development. • Plan and conduct studies in a wide variety of communication technologies including SDR, RF, IP telecommunications and bespoke solutions.. • Conduct research in new communications concepts. • Operate as Design Authority throughout the project throughout the project lifecycle. • Support the test and acceptance team to ensure timely customer acceptance. • Modelling of components of the System design • Robust capture and review of design artefacts as appropriate for all stages in the engineering lifecycle appropriate for managing existing systems and for taking concepts through to production. • Support the system integration and test activities. • Support verification of the system requirements • Close collaboration with software, firmware, and hardware teams to define efficient implementations and optimisations of the system design. Skills, Qualifications & Knowledge Required Essential • Knowledge of the Systems Engineering lifecycle, from development and management of requirements through to and including acceptance testing. • Proven ability in breaking down user requirements into detailed requirement specifications. • The ability to work with and define work for other Engineering disciplines and external suppliers/customers. • Conducting, analysing, and reporting of qualification testing to support design certification. • A general knowledge in most of the following areas and specialist knowledge in one or more: o Corporate and Legislative Requirements o Operational Concept o Use Case Requirement o Functional analysis and specification development o Process System Modelling o Technical Safety o Interface Management / Issues Management Desirable • Experience of Communication systems in one or more of the following: o IP Communication o Modulation techniques and performance o Deployed system propagation effects o Proven ability working on Bids & Proposals and knowledge of military and international specifications and standards o An understanding of DSP principles. • Capable of driving the design process from specification through to production release and support. INDTNMI02",
        "Job Location": "Southampton",
        "Gross Salary": "80 PER HOUR",
        "Payroll Status": "Outside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "SC Clearance Required",
        "Posted Date": "2023-07-25",
        "Job Reference": "221864DFA",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Daniel Farrow",
        "Recruiter Email": "Daniel.Farrow@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/principal-systems-engineer-35"
    },
    {
        "Job Title": "Senior Mechanical Engineer",
        "Job Description": "Senior Mechanical Engineer, Contract , Reading Main Purpose: The role exists in order to develop and implement site mechanical arrangements across all aspects of site activities (e.g. Installation, Commissioning, Operations) in support of the overall project lifecycle. The Senior Mechanical Engineer is responsible for ensuring that activities (e.g. audits) are undertaken to supervise mechanical installation/maintenance/commissioning activities for the MENSA project, establish the implementation status of the above arrangements and the reporting of such information. The site based Senior Mechanical engineer will also undertake specific activities on behalf of the Mechanical function as required. Responsibilities The Operations Group Engineer will • Ensure compliance by personnel and subcontractors with the requirements of the clients Project Safety Plan, The Health, safety, Environmental and welfare Plan and associated documents and legislation. • Ensure that construction work is undertaken to specification by the implementation of safe working methods. • Ensure that changes are effectively controlled and that work is co-ordinated to minimise delays and costs in meeting construction programme dates. • Ensure that contractors and their supervisors are competent to undertake their respective roles and ensure they take positive action to maintain safety, health and environmental arrangements to the highest possible standards. • Actively assist with the production and delivery of documentation for the construction work-pack. • Ensure personnel are appropriately briefed to safely undertake the duties within their control. • Ensure that the construction work is supervised, checked and accepted in accordance with the relevant specifications, drawings and standards of workmanship. • Liaise with designers and / or technical experts to ensure correct interpretation of their requirements and obtain authorisation for modifications as a consequence of local conditions. • Produce forecasts of resource and labour requirements to satisfy the needs of a project programme, for their respective work area. • Keep auditable daily records of work undertaken by themselves and those within their control. • Allocate labour and resources within their area of the works in a manner consistent with the programme of works ensuring that work is appropriately inspected and accepted. • Provide effective communication and co-ordination, liaise on interface working and ensure that overall work is planned and co-ordinated to achieve construction programme dates. • Ensure that construction personnel comply with the requirements of Cavendish Nuclear procedures and where applicable project specific procedures and quality assurance programmes are adhered to and met • Work with the project team to: • Ensure the implementation of the Project Execution Plan (PEP) • Promote a positive health and safety culture in Operations Group • Ensure that harmonious Industrial Relations are maintained • Improve construction safety performance to meet Company targets • Produce, and maintain in a timely manner, the documentation required for their part of the works. This includes Implementation Quality Plans, Method Statements, and Risk Assessments etc. • Identify the need for ‘in-service’ training, for him/herself (and those under his/her control) and to advise management accordingly. Such training will be relevant to both specific tasks and projected career development. • Promote good communications between work group(s), management and centrally based staff. • Comply with the rules and regulations, permit systems and safety requirements in force and to promote these requirements within working parties. • Become conversant with aspects of man management, industrial relations, working agreements etc. • Deputise for Section Leader or the Engineer-in-Charge in the event of absence due to holidays or sickness etc. • Perform other duties as considered appropriate by the Engineer in Charge that lie within the capabilities and experience of the Engineer These duties are project specific and in addition to those described in the Company and project manuals and procedures. He/she shall ensure that they are familiar with these documents, and any legislation to which they refer. The Electrical / Mechanical Engineer may be assisted in the execution of these duties by a team of supervisory staff. The services of the establishment e.g. quality, safety, administration etc. will also be available of which full use should be made.",
        "Job Location": "Reading",
        "Gross Salary": "67 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221859ZB",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Zaida Bhana",
        "Recruiter Email": "zaida.bhana@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/senior-mechanical-engineer-107"
    },
    {
        "Job Title": "Quality Engineer",
        "Job Description": "Site Quality Engineer, Main Purpose: The role exists in order to develop and implement site quality arrangements across all aspects of site activities (e.g. Installation, Commissioning, Operations) in support of the overall project lifecycle. The Site Quality Engineer is responsible for ensuring that activities (e.g. audits) are undertaken to establish the implementation status of the above arrangements and the reporting of such information. The Site Quality Engineer will also undertake specific activities on behalf of the Quality function as required. Key Result Areas: • Developing and implementing site quality arrangements. • Proactively supporting and advising on all aspects of quality on site, including risks and issues. • Developing and maintaining excellent relationships with both internal and external Customers. • As required, ensuring quality requirements are defined and implemented as part of the site induction and training process. • Establishing effective communication channels with Customers (internal and external) and Suppliers. • Developing and implementing appropriate auditing arrangements associated with site activities, both internally and externally (e.g. Suppliers). • Ensuring any site quality non conformances / issues are managed and closed out. • Ensuring Supplier quality arrangements are reviewed and approved / acceptance in accordance with site / project requirements, including Customer approvals. • Monitoring progress against the site quality arrangements, identifying areas of concern to the overall project and where necessary escalate to Line Management. • Liaising with Customers to understand their requirements / expectations for quality assurance, quality control and inspection. • Review of enquiry, tender and contract documentation with respect to customers’ quality requirements and contract specifications, identifying any site specific requirements which fall outside the company quality system. • Undertake quality planning, including the preparation of the site quality documentation and as required the writing of site specific procedures / local working instructions. The inclusion of health, safety and environment aspects should be considered in drafting the site quality documentation. Knowledge: • Good working knowledge of the Nuclear industry and Nuclear License Conditions. • Good working knowledge of all relevant regulations and legislation. • Good working knowledge of the Customers quality requirements • Good working knowledge and application of ISO 9001. • Knowledge of site construction completions systems e.g. OCCMS. • Knowledge of Configuration Management Practices. Experience: • Have experience of Nuclear Construction Site Work. • CSCS card holder • Experience of Drafting ITP’s and construction Installation, Test & Commissioning check sheets. Other: • Ideally be qualified to a HNC or equivalent in a relevant subject e.g. engineering. • Have auditor training. • Willing to travel to locations / sites throughout the UK and occasionally overseas.",
        "Job Location": "Reading",
        "Gross Salary": "49 PER HOUR",
        "Payroll Status": "Outside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221858ZB",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Zaida Bhana",
        "Recruiter Email": "zaida.bhana@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/quality-engineer-149"
    },
    {
        "Job Title": "Electrical Design Engineer",
        "Job Description": "Morson are recruiting an Electrical Design Engineer for their leading aerospace client. Degree level or equivalent, MSc preferred, with a minimum of 5 years of experience in Design of Composite and/or metallic components. Essential skills: - Excellent knowledge of Aerospace Cabin Interior Systems (Galleys, Seats,..) - Excellent knowledge of computerized design and analysis methods (CATIA V5) - Experience with electrical routing design and installations - Good knowledge of Microsoft office - Knowledge of Smarteam - Customer focused/Ability to establish credibility with internal and external customers - Understanding of processes: ECRs, Concessions,… - Understanding of stress principles - Awareness of A/C industry standards, regulations and qualification requirements - Good English verbal and written communication skills - Able to work to tight, demanding deadlines and customer demands - Ability to work effectively within an integrated project team Benefits: - 185 hours holiday per year plus statutory bank holidays - Personal pension scheme whereby 5% contribution from employee and 8% from employer plus salary sacrifice. - Death in service life insurance – covering up to 4x annual basic salary in the event of death in service - PEGI Share Scheme - Cycle to work – cyclesheme - Career development within Safran Group INDTNMI02",
        "Job Location": "Norfolk",
        "Gross Salary": "48 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221593AC3",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Ana-Maria Coman",
        "Recruiter Email": "Ana-Maria.Coman@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/electrical-design-engineer-48"
    },
    {
        "Job Title": "Machinist Fabrication Technician (728)",
        "Job Description": "Machinist /Fabrication Technician Cranfield £17.32p/h equivalent to £35.395pa We are recruiting a Machinist /Fabrication Technician role in Test Services & Site Facilities for one of our automotive clients based in Cranfield. You will be working for a globally recognised automotive company. This is a long-term contract role. The contract is on an ongoing basis a may run for several years. Key Responsibilities of the Machinist /Fabrication Technician: • Lead Machine shop operations within R&D Test Facility using all or some of the following skills: 1. Milling 2.Turning 3. Welding 4. Bench fitting 5 Sheet Metal work. • Manage Machine Shop operations, workflow, and equipment to in-house standards. • Manufacture of Test Rigs/mounts to support trial/test activities • Manufacture of one-off or small batch prototype parts to support test activities or vehicle builds at Production Plants • Modifications to vehicle bodies or complete vehicles (E.g grinding and welding to modify from design intent) • Liaise directly with requestor/engineers to ensure full understanding of requirements of work requested (E.g dimensions, material, timing) • Understanding of basic component measurement techniques to ensure engineering/design dimensional accuracy is met. • Basic Computer literacy (word processing) • Use skills to provide support to other test sections as required. • Automotive experience desirable but not essential • Preparation / building / maintenance of vehicles or components for test. Testing in static and dynamic conditions and Evaluation and concern identification on completion of test. Qualifications & Experience for the Machinist /Fabrication Technician: • Ideally C&G / BTEC L3 in mechanical or automotive engineering with a recognised apprenticeship. • A working knowledge of Word, Excel, and PowerPoint • Excellent organisational skills • Strong attention to detail • Be able to manage and prioritise their work. • Willingness to support adhoc Shift working/Overtime to support on-site testing. Hours & Pay for the Machinist /Fabrication Technician: • Monday-Thursday 08:00-17:00. Friday 08:00-13:20. • 39 hours per week • £17.32p/h equivalent to £35.395pa LMIND",
        "Job Location": "Cranfield",
        "Gross Salary": "17 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "2 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221851BKA",
        "Sector": "Automotive",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Bhavna Kotecha",
        "Recruiter Email": "Bhavna.Kotecha@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/machinist-fabrication-technician-728"
    },
    {
        "Job Title": "Senior Cost Controller",
        "Job Description": "A fantastic opportunity has arisen for a Senior Project Controller to join the team with our prestigious client, this is a hybrid role at their site in Bristol Required Experience Role description As a Senior Project Controller (Cost), you’ll have a role that’s out of the ordinary, you’ll be working on supporting the delivery of vital military satellite communication systems. Your work will directly contribute to shaping the future of military satellite communication systems within defence. And, with our track record of innovation, you’ll continually develop your knowledge and expertise. Day to day, you’ll be supporting the Project Controls Manager in providing project cost control services across the Skynet programme (circa £500m+). We offer flexible working to give people more options to better integrate their work and personal life, whilst ensuring that business needs are met. This role provides hybrid working arrangements, typically 2 days in the office and 3 days working from home or one of our hubs. The Senior Project Controller (Cost) will play a crucial role in managing the financial aspects of the programme from initiation to completion. This includes the development and implementation of effective cost control measures, such as cost forecasting, cost variance analysis and performance evaluation, to ensure that the project remains on track financially against the approved budget. The Senior Project Controller (Cost) will collaborate closely with Skynet team to develop cost estimates and forecasts, identifying potential risks and variance that may impact the Estimate to Complete (ETC). The role will also be responsible for assessing and managing the financial impact of changes in project scope, requirements or objectives, and updating the forecasts accordingly. Your responsibilities will include, but are not limited to: • Assisting the Skynet team in all aspects of Project Cost Control • Prepare and deliver all necessary internal and external cost control reports and documentation • Provide key input into the production and management of Control Account Plans, including establishing basis of estimates and cost related assumptions and dependencies • Collate, organise, and present the necessary data to enable Earned Value Management (EVM) reporting • Provide the necessary input to enable Cost Risk Analysis (CRA) • Coordinate and develop project/programme spend projections, cost reconciliation and variance analysis • Coordinate and develop project work-in-progress (WIP), commitment and estimate at complete (EAC) forecasts Required Experience /Qualification /Attributes: This role will suit candidates with a background in finance, accountancy, project management and project controls looking for a change in direction and a strong desire to develop themselves, as well as people with existing project experience as a project cost engineer • Considerable experience in the advanced application of Project Management techniques in a relevant technical project environment across the full project lifecycle • Previous experience on complex defence and/or telecommunication projects/programmes, preferably military SatCom (desirable, but not essential) • Ability to champion high performance and inspire others • Experience in the application of SRA/CRA and EVM • Strong commercial awareness and an understanding of contract and commercial management • Experience working with senior level managers both internally and externally. • APM PMQ, Chartered status or equivalent (advantageous) • PPC Practitioner Recognising the restricted nature of the work  there is a requirement for the candidate to be eligible to obtain Security Clearance for this role. INDTNMI02",
        "Job Location": "Bristol",
        "Gross Salary": "60 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Hybrid",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-25",
        "Job Reference": "221850JMM",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Janet Mottram",
        "Recruiter Email": "Janet.Mottram@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/senior-cost-controller-1"
    },
    {
        "Job Title": "Metering Engineer",
        "Job Description": "Repsol are looking for a Metering Engineer to join their team on a long term contract basis. Role: Metering Engineer Business: Repsol Sinopec Location: Aberdeen/hybrid style working Rate: Inside IR35. Umbrella or PAYE options available Position Overview Provides metering technical expertise and operational support to the business, including site and offshore metering, production and maintenance personnel Accountabilities Fiscal, allocation and environmental metering systems are installed, maintained and operated safely and efficiently to the standards required to satisfy all stakeholders Timely and accurate metering and measurement, appropriate to the business and regulatory requirements Maintain a firm understanding of the threat Cyber Attacks pose in both regular IT (Information Technology) and OT (Operational Technology / industrial automation) environments and the potential consequences of such attacks Key Duties Provides day to day technical support to the offshore metering technicians and progress longer term metering issues Maintain site dispensation, mis-measurement, audit tracker, site action and environmental status trackers Update of existing metering manuals and procedures as required Provide support to the HCA team on data validation and mismeasurements Preparation of AFA’s and ‘package management’ of key metering scopes, including upgrades and modifications to metering systems Mobilisation of offshore metering personnel in conjunction with integrated plan Action timely purchase, repair, calibration and recertification of field and test equipment Accompany regulator and third parties on audits Professional Skills & Experience Good technical understanding of regulations, codes, standards, guidelines and good practice for the UKCS oil and gas industry, relevant to role Sound understanding of hydrocarbon accounting and metering methods and procedures Commercial awareness and understanding of offshore oil & gas production, transportation and onshore processing systems Experience in development and interrogation of database systems and spreadsheet based solutions Circumstances Frequent visits to offshore production facilities",
        "Job Location": "Aberdeen",
        "Gross Salary": "500 PER DAY",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Hybrid",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-24",
        "Job Reference": "221847NFO",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Niamh Forbes",
        "Recruiter Email": "Niamh.Forbes@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/metering-engineer-4"
    },
    {
        "Job Title": "Solution Engineering Manager R0222967",
        "Job Description": "Systems Engineering Manager Location: Templecombe or Cheadle to suit the candidate – Flexible 3 days onsite Duration: 12-months contract – Outside IR35 Pay rate: £60 - £70 Per Hour Ltd (outside IR35) Overview A successful candidate will provide the principal engineering delivery leadership, direction, decision authority and support to our defence client for a sonar System Engineering programme. Key Responsibilities and Tasks: • Defining and delivering the strategy, plan and implementation of the overall Engineering Solution for the Programme. • Directing and providing overall technical and engineering leadership to the team assigned to the project to deliver the Engineering solution to time, cost and quality. • Ensuring the timely and accurate production of the Requirements for the System and Subsystems and ensuring that sell-off & IVVQ of the requirements is planned, documented and achieved in a progressive and low risk manner • Ensuring that the Programme’s Design and other Technical Certification is co-ordinated, complete and coherent with the delivered and installed base and can be provided for Business approval and delivery to the customer • Leading the interfacing with the Engineering teams of the client and other external Engineering parties to ensure that the integration and migration of the overall Engineering solution is achieved • Overseeing the development of cost and time estimates for project activities to meet business and customer objectives. • Validate the engineering delivery progress and support the accurate measurement of progress on the project. • Participating with other members of the Programme or bid senior management team to ensure that the Programme or bid meets its business and customer objectives. • Working with the Engineering Functional Teams to ensure that the Programme’s Engineering team are competent, developed to their full potential, mobilised and released in a timely and planned manner. Skills (underpinning Knowledge) Ability to develop innovative and low risk practical engineering strategies to manage a complex project through its lifecycle. Strong analytical skills supporting logical, effective and timely decision making. Proven ability in working with DOORS. Proven ability in an Engineering Management role, within the defence industry would be desirable but would consider other safety related industries e.g. maritime/aerospace/nuclear etc. Proven ability gained across the engineering lifecycle for complex electronics / hardware / Software Products Additional Please note, due to the sensitive nature of the projects involved all candidates must be capable of gaining a UK MOD Security Clearance to SC level. If you are not currently SC cleared you will be able to start on a baseline check with a new SC pending.",
        "Job Location": "Somerset",
        "Gross Salary": "70 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "SC Clearance Required",
        "Posted Date": "2023-07-24",
        "Job Reference": "221574ABD",
        "Sector": "Engineering",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Amadu  Balde",
        "Recruiter Email": "Amadu.Balde@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/solution-engineering-manager-r0222967"
    },
    {
        "Job Title": "Process Engineer",
        "Job Description": "Our client a leading Oil and Gas Operator based in Aberdeen are currently recruiting for a Process Engineer to join their team on a contract role initially. Ideally for this role they are looking for an experienced Process Engineer with a strong Oil and Gas background. For more information see below: Position Overview Carry out Process engineering activities related to Operations, Engineering and Modifications associated with Asset in support of Repsol Sinopec Resources UKs business objectives of producing Hydrocarbons in a safe and cost effective manner. Accountabilities • Provide day to day process engineering support for the Asset teams offshore and onshore • Discuss with appropriate Technical Authority any issues that impact SECE’s • Maintain a firm understanding of the threat Cyber Attacks pose in both regular IT (Information Technology) and OT (Operational Technology / industrial automation) environments and the potential consequences of such attacks • Maintain a firm understanding of the threat Cyber Attacks pose in both regular IT (Information Technology) and OT (Operational Technology / industrial automation) environments and the potential consequences of such attacks Key Duties • Provide day to day process engineering support for the Asset teams offshore and onshore • Appointed as Process Engineering competent person by appropriate Technical Authority • Identify potential areas for optimizations of the asset process systems • Identify and understand production threats and opportunities, and work with the Operations Team in resolving and/or minimising threats and developing opportunities • Provide direction to other process engineers in the conduct of engineering activities to ensure a safe and environmentally responsible operation • Ensure the quality of engineering deliverables produced by other Process Engineers for the Asset are compliant with current and future offshore legislation, agreements, regulatory and company standards affecting Maintenance and Engineering activities, and are consistent with best engineering practice • Comply with HSE&A principles, policies and procedures • Role model for safe and environmentally responsible behaviours • Ensure effective and timely close out of Synergi and ICP actions • Conduct periodic site Process Safety reviews/audits in line with Operations schedule • Conduct periodic “cold eye” observations (e.g. during otherwise planned site visits) and produce timely reports • Participate in regular performance management dialogues with Operations Manager • Review and comment when necessary on technical documents produced by Vendors, 3rd party contractors and Repsol Sinopec Resources UKs Engineering Contractor • Review and respond to Technical Queries as required • Review and approve shutdown leak test work packs prepared by 3rd parties • Review of Technical Queries in compliance with HSE26 (i.e. leak testing procedure) • Participate with Site Operation Team to develop proposals to overcome deficiencies in existing process plan design • Prepare or delegate the issue for approval of Statement of Requirements (SOR) for engineering works • Responsible as for the approval of vendors, 3rd party contractors and Repsol Sinopec Resources UK’s main Engineering contractor’s process technical documents in a timely manner • Responsible for the delivery and cost control of the agreed process study work load via delegation to site process engineers or process consultants • Prepare the review, and preparation of new or revision to Site Operating Procedures • Participate in risk assessment, Root Cause Analysis, safety operation assessments • Prepare or delegate preparation of AFE budget applications • When required conduct prestart up audits prior to completion of major project/modifications • Promote technological innovations that can be economically exploited to improve safety or production performance for Repsol Sinopec Resources UK’s facilities • Provide Process design and analysis to enable the safe and efficient implementation of modifications within project targets, and assist in the preparation of project / operational work plans Education Attainment & Accreditation • Degree qualified or equivalent in a Chemical / Process engineering discipline, preferably chartered Professional Skills & Experience • Extensive, design engineering and operations experience within the oil and gas industry Job Description Interpersonal Skills & Qualities • Adherence to Repsol Sinopec Resources UK’s values • Flexible, open-minded ability to work in a high pressure environment and meet tight deadlines • A self-starter, able to one’s own initiative to identify and lead business improvements as required • Capacity to acknowledge and analyse large quantities of information • The ability to be decisive by making well thought-through and timely decisions • Excellent interpersonal skills and a good facilitator • Resilient team player, embraces change and continual improvement • Ability to communicate business, technical and commercial concepts to many levels in Oil & Gas organisations • Strong safety awareness INDTNMI08",
        "Job Location": "Aberdeen",
        "Gross Salary": "600 PER DAY",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-24",
        "Job Reference": "221842GC2",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Gordon Clark",
        "Recruiter Email": "gordon.clark@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/process-engineer-62"
    },
    {
        "Job Title": "Quality Administrator",
        "Job Description": "Quality Administrator 12 Months Rosyth Inside IR35 We are seeking a skilled and motivated Quality Administrator to join our clients Quality department on the Type 31 Frigate Programme. The successful candidate will play a crucial role in ensuring the smooth running of the department by undertaking various clerical and administrative duties. The Quality Administrator will be responsible for processing documents, reconciling records, collating data, producing reports, and maintaining effective communication with stakeholders, customers, and suppliers. Additionally, the role involves supporting the T31 team with bookings, problem-solving, filing, and raising non-conformances, while ensuring accuracy and compliance in all tasks. Responsibilities: • Perform a range of clerical and administrative duties to support the smooth running of the Quality department. • Process and reconcile documents and information from various sources to ensure accuracy of data and system records. • Conduct initial investigations into discrepancies and shortages, utilizing statistical information, document control, or physical stock control. • Collate data and generate routine reports, schedules, summaries, and letters for internal and external circulation. • Foster positive relationships with stakeholders, customers, and suppliers, exchanging information to facilitate smooth operations. • Verify calculations, allocate costs, obtain correct authorization, and gather information for incomplete or incorrect documents. • Maintain an up-to-date filing system to ensure easy retrieval of information for others. • Support the T31 team with weekly bookings, processing timesheets, and progress reports in the reporting system. • Effectively resolve problems related to bookings, shop orders, work orders, and center changes, ensuring accurate and timely reconciliation. • Manage meeting room bookings and allocate lockers as required. • Raise Non-Conformances on behalf of the Quality department. • Coordinate the ordering of specialist equipment and liaise with team leaders and purchasers. Requirements: • Strong communication and interpersonal skills. • Excellent people skills to interact effectively with various stakeholders. • Proactive and self-starting approach to work. • High level of attention to detail. • Well-organized and capable of meeting tight deadlines. • Ability to react quickly when necessary to achieve challenging objectives. • Proficiency in Microsoft Office and general IT abilities. • Ability to react quickly when necessary to achieve challenging objectives. • Proficiency in Microsoft Office and general IT abilities. • At least 2 years of experience in a similar Quality Administration role. • Proven experience in Quality Administration. • Good working knowledge of IT software packages such as IFS, CMS, Office, and SAP. • Strong communication skills and the ability to present information effectively. • Must be able to obtain full Security Check (SC) clearance. • Must be able to obtain ITAR clearance. Morson is acting as an employment business in relation to this vacancy. INDTNMI02",
        "Job Location": "Rosyth",
        "Gross Salary": "16 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-24",
        "Job Reference": "221839JCO",
        "Sector": "Office & Administration",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Jordan Collins",
        "Recruiter Email": "Jordan.Collins@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/quality-administrator-9"
    },
    {
        "Job Title": "Safety Case Support - Technical Author",
        "Job Description": "We have an exciting new opportunity for a SAFETY CASE SUPPORT - TECHNICAL AUTHOR based in West Cumbria Role Description: Maintain a safe working environment for all personnel and visitors. Promote a positive, professional view of the company. Adhere to the company’s standards and expectations. Communicate effectively with clients and all levels of personnel. Follow safe working practices on plant visits. Gather information from technical drawings, client documentation and site visits to enable technical documentation production. Produce technical documentation to programme and cost to the current defined process (MP-3-3-006 Technical Documentation Production). Mentor Technical Author 2 and Junior Technical Authors within a small team. Essential Qualifications and Experience: ONC or above in an engineering subject and/or in excess of five years’ experience in an engineering discipline. IOSH Working Safely. Demonstrate experience in engineering principles, practices, theories and technologies related to mechanical, electrical or instrumentation disciplines. Demonstrate experience in technical documentation production. IT skills – Microsoft Word and Excel as a minimum. Desirable Qualifications and Experience: Basic knowledge of nuclear safety/active plant operations an advantage but not essential. Ability to review/cross reference/update technical documentation, such as Clearance Certificates and Operator Instructions. Able to interpret minutes from technical committees (i.e. MSC/PMP) and translate into plant level documentation. Basic understanding of nuclear safety case an advantage but not essential. Ability to deputise for Safety Case Manager at stakeholder meetings (requires good written/verbal communication skills). Multi-disciplined preferred. Ability to work independently or as part of a team.",
        "Job Location": "Cumbria",
        "Gross Salary": "35 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-24",
        "Job Reference": "221840GJA",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Gillian James",
        "Recruiter Email": "Gillian.James@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/safety-case-support-technical-author"
    },
    {
        "Job Title": "Procurement Officer",
        "Job Description": "A fantastic opportunity has arisen for a Procurement Officer to join the team with our prestigious client BAE Systems at their site in Barrow in Furness Purpose of role: • To provide support to the Supply Chain capability, working as a member of the business or function to provide expertise and support ensuring suppliers achieve the required delivery, cost and quality performance targets to support the programs in line with Procurement Governance and the Company Business Targets. • To undertake all tasks as necessary to support the achievement of the functions objectives, in accordance with process and procedures • To ensure compliance with the BAE Systems Operational Framework requirements by ensuring adhere to all processes and procedures. Key Technical Skills • Basic awareness of supplier management techniques • Basic awareness of commercial aspects of contracts • Proficient in the use of appropriate IT packages including Microsoft Office Applications. • Ability to respond to internal/external customer enquiries, providing information and guidance as appropriate. • High level of accuracy when inputting and cleansing data • Ability to prioritise work load and set /meet customer expectations • Can take ownership of problems and will attempt to resolve issues before escalating. Key Interpersonal/Behavioural Skills • Two-way communication – ability to communicate with peers both internally and externally. • Ability to obtain information for different sources • Proactive and self-motivated. • Ability to escalate issues if and when they occur. Top 6 Major Tasks and Activities: 1. Undertake with support transactional supply chain activity in support of our customer contract requirements including raising Request for Quotations, negotiating price and lead times, creating and managing purchase orders, expediting delivery and managing payments and contract change. Ensure compliance with Governance, Process and procedures. 2. Create expediting reports and undertake the expediting activity with suppliers to ensure on-time deliveries in accordance with the programme requirements. 3. Communicate with suppliers and internal / external stakeholders – resolving a wide variety of routine problems and quality issues, escalating complex / high impact issues when necessary. 4. Operate and administer IT Applications i.e SAP ERP system with quality, accurate information relating to the supply chain activity, in accordance with policy and process. 5. Develop and maintain strong relationships with internal customers to optimise engagement and communication at all times. 6. Identify potential cost saving opportunities and log them. • Key Outputs/Deliverables: Business Unit 1. Accurate and timely issue of Purchase Orders 2. Accurate and timely process of invoice queries 3. Accurate and timely updates of systems 4. Accurate and timely provision of information to Principal Procurement Officer Describe with whom the role regularly interfaces: 1. Principal Procurement Officer 2. Procurement Peers 3. Other functions e.g. Engineering, Operations and Logistics. 4. Suppliers Recognising the restricted nature of the work  there is a requirement for the candidate to be eligible to obtain Security Clearance for this role. INDTNMI02",
        "Job Location": "Barrow-in-Furness District",
        "Gross Salary": "23 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-24",
        "Job Reference": "221834JMM",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Janet Mottram",
        "Recruiter Email": "Janet.Mottram@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/procurement-officer-22"
    },
    {
        "Job Title": "5x Mobile Systems Engineers",
        "Job Description": "IT TECHNICIAN / MOBILE SYSTEMS ENGINEER Steveange & Hemel Hempstead location. Must have own car and drivers license. 6 month contract duration. £250 per day (this is inclusive of petrol expenses). Inside IR35 (Umbrella company). Hours are 7am - 3pm (some flex if needed). There are roughly 2,500 Panasonic touchpads that need replacing, alongside other aspects of desktop and mobile support. The touchpads need replacing and swapping to newer versions. This will also include migrating files across and setting up email signatures etc. The Mobile Systems Engineer role will be mostly helping with the roll-out of the touchpads as the main duty. You will also be fitting in with the BAU support to help geographically split people to deal with hardware failures and password support etc across all the locations. Skills & Experience: • Asset work, recording devices handed out and coming back. • Organised, dealing with millions of pounds of assets. • Confident with field engineers and engaging with them. • Windows 8.1 (ideally) and tablets / touchpads experience. • Office 365, niche software, SAP WORK MANAGER, CITRIX, GADMS, can be taught. • Attitude and willingness to learn. • Handing devices over to customers. • Personable. To apply, please click the link or send your application to alex.mcquade@morson.com",
        "Job Location": "England",
        "Gross Salary": "250 PER DAY",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-24",
        "Job Reference": "216055ALX",
        "Sector": "IT",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Alex McQuade",
        "Recruiter Email": "Alex.McQuade@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/5x-mobile-systems-engineers"
    },
    {
        "Job Title": "Project Quality Engineer",
        "Job Description": "We have an exciting new opportunity for a PROJECT QUALITY ENGINEER based in West Cumbria: About the Role: Project Quality Engineer reporting to the Site Construction QA QC Manager. To review and endorse Quality Plans and Inspection and Test Plans, undertaking associated compliance verification activities as appropriate. To understand and implement the processes necessary for the provision of timely appropriate Quality support to other BEP Delivery Team departments. To conduct Quality audits & Surveillances of BEP site activities and sub-contractor operations on site, and off site as directed and in accordance with the Project Audit Schedule. To ensure the quality standards of the BEP Project are consistently met, raising authorised project documentation where this is not the case. Essential Experience and Qualifications: Sellafield/Nuclear experience working in a QA function or QC function with development into QA via lead audit and CQI membership. Oversight of subcontractors, compilation and review of lifetime records. Understanding of ISO 9001 quality management systems and Sellafield CQRM. Maintenance of package status & progress reporting, raising issues and liaising with the project and client QA/QC team ISO 9001 Lead auditor CQI membership QC qualifications CSWIP/PCN/ICORR in welding inspection/NDT & Coatings desirable but not essential Design Tools/Software: General MS Office Package",
        "Job Location": "Cumbria",
        "Gross Salary": "50 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-24",
        "Job Reference": "221697GJA",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Gillian James",
        "Recruiter Email": "Gillian.James@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/project-quality-engineer-16"
    },
    {
        "Job Title": "Permit Engineer",
        "Job Description": "We have an exciting new opportunity for a PERMIT ENGINEER based in West Cumbria, About the Role: To function as part of a multi-disciplined team to energise, isolate and commission specific Systems / Equipment in a safe, effective and timely manner. To prepare, issue and close Safe Systems of Work. Safety Accountabilities: Ensure all Permit Office activities are carried out in accordance with all Site Licence, Environmental, Regulatory and Industry requirements, including HSG250 and HSG253. Ensuring a proactive and balanced approach to safety (Nuclear, Environmental and Conventional) to ensure that Permit Office safety is optimised during commissioning. Advise and support the Permit Office Manager in confirming that plant and equipment can be safely energised to carry out meaningful testing. Quality Accountabilities: Carrying out all Permit Office activities in line with the approved test documentation and relevant Commissioning Management Procedures. Maintain all documentation associated with Permit Office activities. Ensure all Permit Office test equipment is calibrated and has certification. Additional Accountabilities: Carry out all energisation and isolation activities in a safe, effective and timely manner through all stages of commissioning. Liaise with all supporting functions including Site Construction and Operations Teams to complete energisations and isolations effectively. Maintain a close working relationship with the engineers involved with interfacing systems and areas. Communicate technical information within own areas of expertise to a wide variety of supporting functions through the use of reports etc. To assist in the development of plans, strategies and programmes in support of efficient and effective Permit Office activities. To provide input as a Key Stakeholder to the Risk Assessment process. Essential Experience and Qualifications: Appropriate technical qualification (C&G, ONC, HNC) in an engineering discipline. Has had previous experience as a Permit Engineer in the commissioning of nuclear or similar plants. Design Tools/Software: Competent in the use of standard Microsoft IT packages e.g. Word and Excel.",
        "Job Location": "Cumbria",
        "Gross Salary": "47 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-24",
        "Job Reference": "221673GJA",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Gillian James",
        "Recruiter Email": "Gillian.James@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/permit-engineer"
    },
    {
        "Job Title": "Embedded C/C++ Software Engineer",
        "Job Description": "Embedded C/C++ Software Engineer Location: Bristol Duration: 6 months contract Pay rate: £55 to £65/hour (Umbrella) / £40.94 to £48.38 (PAYE basic) We are a world leader in missile and missile systems looking for a highly capable and adaptable software engineer to join our Development Facility in Bristol. You will be responsible for developing the real-time systems application software for the next generation of Missile Systems. This is a technical hands-on role and will involve designing, implementing and testing the embedded software for the missile products. Key Tasks / Responsibilities: Demonstrable Proficiency of hard real time software development Strong C / C++ Programming Ability to develop, test and integrate low level software drivers. Generating and executing software test harness’s Good problem-solving capability to investigate software/hardware issues. Proficiency in working on controlled Software environment. Proven ability of working in a lab environment running embedded software. Use of configuration control tools such as RTC Additional useful skills include : Strong UML knowledge (ideally using Rhapsody) Proven ability in working with the Texas Instrument (TI) TDA4 family of devices. Proven ability of working with Python Competent with MS word, for reviewing and updating technical documentation. Additional Information: Please note, due to the sensitive nature of the projects involved, all candidates must be capable of gaining a UK MOD Security Clearance to SC level. If you are not currently SC cleared the client will sponsor a new application but this will need to be granted before you start. This role shall operate inside IR35. INDTNMI02",
        "Job Location": "Bristol",
        "Gross Salary": "65 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "SC Clearance Required",
        "Posted Date": "2023-07-24",
        "Job Reference": "221811ABD",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Amadu  Balde",
        "Recruiter Email": "Amadu.Balde@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/embedded-c-slash-c-plus-plus-software-engineer-5"
    },
    {
        "Job Title": "P6 Project Planner Sizewell C",
        "Job Description": "We have an exciting opportunity to be part of the Sizewell C Ecology Mitigation works for a P6 Planner. The Schedulers will be utilising processes and tools (P6) to support the delivery of the Works including the overall master Plan and Project Specific schedules. Specific Responsibilities: • Engage with key stakeholders to create and maintain project schedules including baselines in order to feed logic driven milestone dates into the project management system (ePro) • Develop close working relationship with delivery teams and gain an understanding of the delivery requirements of projects • Attend meetings from initiation and throughout the lifecycle of the project And contribute towards effective project level scheduling • Own and maintain generic project templates used to augment project schedules and promote consistency, knowledge sharing and best practice • Deliver training as required • For larger projects (>£1m) ensure that relevant schedule reporting is delivered, including advising Programme Manager, customers and stakeholders of any schedule issues that may compromise a project. Use project and pipeline programmes to inform resource decision making • Create monthly resource profiles and heat map so as to understand resource utilization and identify opportunities for re-assignment to improve project completions across functions • Provide co-ordination and support in multi projects delivery and ensuring that the integrated master schedules are updated and any identified risk and opportunities are adequately communicated to stakeholders. • Liaises with the Leadership Team and Project Support Group to ensure appropriate support in place to enable successful delivery Specific experience: • P6 • Excel • Knowledge of key project management processes e.g. CPA, EVM. This will be a contract role initially for 8 months. 40 hours per week. This will be a mixture of working on site at Sizewell C and some working from home days. INDTNMI07",
        "Job Location": "Suffolk",
        "Gross Salary": "52 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "8 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-24",
        "Job Reference": "221663NPB",
        "Sector": "Construction & Civil Engineering",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Natalie Pritchard-Barrett",
        "Recruiter Email": "leiston@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/p6-project-planner-sizewell-c-4"
    },
    {
        "Job Title": "Snowflake and DBT Data Engineer",
        "Job Description": "Snowflake and DBT Data Engineer - £650 per day - Outside IR35 - 6 months - Primarily remote 1-2 days on site per month in Hemel Hempstead. My client, a global leader in the hospitality industry is looking for an experienced Data Engineer to join them on a contract basis. My client is currently undergoing an exciting migration to Snowflake and is seeking a talented and experienced Data Engineer to provide critical support during this transformation. This opportunity offers you the chance to be at the forefront of cutting-edge data engineering and contribute to the success of a large-scale migration. Your Role and Responsibilities: As a Senior Data Engineer, you will be responsible for various aspects of the development lifecycle related to data modelling, process design, development, and testing. You will work closely with senior stakeholders across multiple verticals, collaborating to achieve analytics requirements and optimize existing models. Your expertise in Snowflake, AWS, DBT, and SQL will be essential in driving the successful completion of the migration. Key Skills and Experience: To excel in this role, you should possess the following skills and experience: Snowflake and DBT Experience: A minimum of 12 months of hands-on experience working with Snowflake and Data Build Tool (DBT). Advanced SQL Knowledge: Proficiency in SQL with the ability to write complex queries and optimize database performance. AWS Cloud Experience: Hands-on experience with AWS cloud technologies, particularly in data tooling and development. Continuous Integration and Continuous Deployment (CI/CD): Understanding of CI/CD principles to ensure efficient and reliable data engineering processes. Programming Languages: Development experience in one or more object-oriented programming languages, such as Python. Stakeholder Management: Ability to collaborate effectively with senior stakeholders across various business units.",
        "Job Location": "Hemel Hempstead",
        "Gross Salary": "650 PER DAY",
        "Payroll Status": "Outside iR35",
        "Location Type": "Remote",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-24",
        "Job Reference": "221814BCO",
        "Sector": "IT",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Brendan Costello",
        "Recruiter Email": "Brendan.Costello@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/snowflake-and-dbt-data-engineer"
    },
    {
        "Job Title": "Finance Assistant",
        "Job Description": "Morson are proudly working with a leading main contractor who are currently looking for a Finance Assistant to be based on their project close to central London. The Finance Assistant is required to procure quotations from suppliers as well as provide internal quotations for works which can be delivered by the in-house team. They require a proactive person who will actively resolve any queries arising from the invoices, payments or quotations. Payment Applications Prepare Monthly Payment Applications Analyse supplier payment applications with Project Team Updating P&L files Answer invoice queries Issue Payments via COINS Software The successful candidate will have the following Experience using COINS/Maximo systems 5 years experience in finance Raising invoices Excellent computer literacy This role will initially be 2 months however can be extended due to works. If you would be interested, please apply via this posting. INDTNMI51",
        "Job Location": "London",
        "Gross Salary": "15 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "2 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-24",
        "Job Reference": "221796CH1",
        "Sector": "Banking, Financial Services & Accounting",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Charlie Hopkins",
        "Recruiter Email": "charlie.hopkins@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/finance-assistant-37"
    },
    {
        "Job Title": "Receptionist",
        "Job Description": "Morson are recruiting a receptionist for a 3 month contract based in Warrington. Key Responsibilities Managing reception duties, post & signing people off and on site. Key Skills Good communicator required. Please send CVs to john.kingham@morson.com",
        "Job Location": "England",
        "Gross Salary": "10 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "3 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-24",
        "Job Reference": "221793JKM",
        "Sector": "Office & Administration",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "John Kingham",
        "Recruiter Email": "john.kingham@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/receptionist-137"
    },
    {
        "Job Title": "Senior CS&A Engineer",
        "Job Description": "CS&A Engineers (various levels) urgently required to support our Clients various projects . Responsibilities: - Day to day, you’ll be part of a dynamic team undertaking bespoke and innovative designs of reinforced concrete, steel and masonry structures across all aspects of the nuclear life cycle, from initial concept and scheme design, through engineering and detailed design and build, operations and maintenance, to decommissioning, waste management and remediation. The projects you undertake will often be in relation to structures and infrastructure associated with state-of-the-art mechanical handling equipment and their processes and electrical systems but can also involve stand-alone civil/structural tasks for a range of sectors, for example structural inspections and site surveys, and will be undertaken primarily for sites across UK with some projects based internationally. Essential Experience • Degree Qualified (BEng or MEng), Civil / Structural Engineer • Chartered or Incorporated Engineer with membership of ICE or IstructE or working towards. • Awareness and experience of using the latest design codes and standards. • Understanding of the relevant legal and regulatory standards. • It would be advantageous to have previous experience in the design of structures in reinforced concrete and steel. • It would be advantageous to have previous experience within the nuclear industry (or other high hazard industries) and design for seismic loading.",
        "Job Location": "Gloucestershire",
        "Gross Salary": "65 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-23",
        "Job Reference": "220970ZB",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Zaida Bhana",
        "Recruiter Email": "zaida.bhana@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/senior-cs-and-a-engineer-14"
    },
    {
        "Job Title": "Senior CS&A Engineer",
        "Job Description": "CS&A Engineers (various levels) urgently required to support our Clients various projects . Responsibilities: - Day to day, you’ll be part of a dynamic team undertaking bespoke and innovative designs of reinforced concrete, steel and masonry structures across all aspects of the nuclear life cycle, from initial concept and scheme design, through engineering and detailed design and build, operations and maintenance, to decommissioning, waste management and remediation. The projects you undertake will often be in relation to structures and infrastructure associated with state-of-the-art mechanical handling equipment and their processes and electrical systems but can also involve stand-alone civil/structural tasks for a range of sectors, for example structural inspections and site surveys, and will be undertaken primarily for sites across UK with some projects based internationally. Essential Experience • Degree Qualified (BEng or MEng), Civil / Structural Engineer • Chartered or Incorporated Engineer with membership of ICE or IstructE or working towards. • Awareness and experience of using the latest design codes and standards. • Understanding of the relevant legal and regulatory standards. • It would be advantageous to have previous experience in the design of structures in reinforced concrete and steel. • It would be advantageous to have previous experience within the nuclear industry (or other high hazard industries) and design for seismic loading.",
        "Job Location": "Gloucestershire",
        "Gross Salary": "55 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-23",
        "Job Reference": "220972ZB",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Zaida Bhana",
        "Recruiter Email": "zaida.bhana@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/senior-cs-and-a-engineer-13"
    },
    {
        "Job Title": "Business Support Assistant",
        "Job Description": "In partnership with a well-established and innovative utilities business, Morson Talent are recruiting for a Business Support Assistant. Our client is a market-leader in the industry, working closely with the government to achieving Net-Zero emissions by 2050. It is a great opportunity to join our client, not only will open plenty of career opportunities, but also be part of a organisation that puts employee well-being at the core of it's values - proven through being recognised as \"Top 5 Employer of the Year\" in the Sunday Times on frequent occasions. About the Role We are seeking candidates, who can demonstrate great administration and organisational skills but also passionate about delivering quality customer experience. We are open to profiles from Legal Administrators to Retail Assistants that can work well under pressure and willingness to learn but also adaptable. Reporting to the Property & Consents Connections Manager, the purpose of the Business Support Assistant is transfer payment accounts, extract key consent information from documents and tie to existing Engineering, Geographical, Customer and Payment records. When necessary, it will be a requirement of this role to deal with customer enquiries and provide support to P&C Managers and Surveyors. Responsibilities: Provide the administrative/technical support to client's WPS Project. Be proficient in the interpretation of consent documentation and be accurate in the input of new consent records into a Property/Payment Management Systems as well as Document Management System. Be proficient and accurate in extracting and combining Engineering, Geographical, Customer, Payment and Consent records from a number of differing electronic sources. Be competent and accurate in following a GIS based process that would enable a Land Registry Overlay to be incorporated onto existing mapping system. Provide internal and external customers with copy documents or consent data, where appropriate, within agreed service level targets. Provide administrative and technical support to P&C Managers and Surveyors. Be professional and courteous when dealing with internal and external customers on all communication media and manage customer enquiries efficiently and to target. Active participation in Individual Performance Review sessions with your Line Manager. Attendance at team days and monthly Face-to-Face briefings. Active participation in the Team Safety, Health and Environment Action Plan. Skills & Experience: Be a confident and effective communicator with excellent customer service skills. Strong abiliity to use MS Office packages and experience in using SAP advantageous but not essential as training will be given. Previous experience of administration work in a conveyancing law firm advantageous; or awareness of the legal aspects associated with consent and the electricity industry desirable also. To be able to build and develop relationships with key stakeholders for your role. You will be a self-motivating team worker with the ability to work in a pressured environment as part of a highly focused team with the drive and ability to work co-operatively with others to achieve shared goals. You will also possess the ability to work on your own initiative, problem solve and have a flexible attitude to work. What's on offer? £15+ Hourly rate + holiday pay (via PAYE or Umbrella) Monday to Friday, 37 hours per week Hybrid-working model (3 days office based, 2 home-working) 6-9 months' initial contract (scope for additional 9-months' extension) Entry to long-term career opportunities INDTNMI80",
        "Job Location": "Hampshire",
        "Gross Salary": "16 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Hybrid",
        "Assignment Length": "9 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-21",
        "Job Reference": "221458BSK",
        "Sector": "Office & Administration",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Bradley Skolozdra",
        "Recruiter Email": "Bradley.Skolozdra@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/business-support-assistant-21"
    },
    {
        "Job Title": "Principal Systems Engineer -  (AVC Test Capability)",
        "Job Description": "Principal Systems Engineer (AVC Test Capability) Client – BAE Systems Location – Barrow – 1 to 2 today on site per month Duration – 12 months initially Rate - £74.20 Umbrella Role Description: The Principal Engineer – Systems will leverage their subject matter expertise and domain experience to support their team in delivering high-quality systems and products for submarine design, build, and through-life support programs. They will provide valuable advice and expertise to other functional areas, ensuring overall project delivery and performance. Responsibilities: Apply a good understanding of relevant maritime legislation, industry standards, and defence standards to ensure compliance and quality in system design. Understand customer and user needs to influence and impact design activities, technical performance, and operational effectiveness. Monitor and report on the status of engineering activities, identifying problem areas and implementing recovery plans. Manage change embodiment activities as necessary. Stay updated on major developments and changes in Systems Engineering across industry and academia, and be aware of potential future technologies relevant to the team. Lead, undertake, and develop others in various activities such as systems integration, system architecting, design for requirements definition and management, verification and validation, and qualification design. Conduct all work safely and adhere to a high level of quality by following business processes, discipline best practices, and utilizing suitable toolsets. Core Duties: Provide specialist knowledge and subject matter expertise in the development of submarine systems, including defining systems architecture, components, interfaces, and data. Ensure comprehensive design proving evidence is captured within requirements management tools and endorsed by the appropriate level of authority. Support the flow-down of requirements to suppliers and acceptance of their deliverables, ensuring proper documentation and recording. Assist in estimating the scope of work and resources required for systems engineering activities to support bids, proposals, and project planning. Provide technical support to integrated performance and acceptance activities, from supplier equipment acceptance to system acceptance by the customer. Document domain knowledge and actively contribute to the growth of the knowledge base within the business teams. Provide technical guidance to other engineers and support the engineering management team in planning and controlling specialist activities. Key Accountabilities and Deliverables: Capture and agree on technical requirements in accordance with company and program processes. Deliver compliant technical solutions that meet contractual requirements and regulations. Generate, capture, configure, and control design documentation in accordance with company processes. Manage design change requirements and associated documentation in accordance with company processes. Ensure adherence to engineering Lifecycle Management (LCM) for all deliverables and provide relevant input to project LCM activities. Provide specialist technical input, review, and support to projects beyond immediate scope as an independent contributor. Utilize systems experience and knowledge to strategically develop other engineers and relevant team members. Subject Knowledge and Qualifications: Extensive knowledge and expertise in Systems Engineering processes and practices within the defence, maritime, or related industries. Familiarity with the engineering lifecycle and experience in the relevant phase of the role. Technical understanding of the context of their work within the overall product and platform/program. Strong understanding of related project, product, program, domain, discipline, and functional teams within the submarine industry or equivalent external bodies. Strong working understanding of Product Safety and SHE (Safety, Health, and Environment) principles. Note: SC clearance is required for this role. INDTNMI02",
        "Job Location": "Barrow-in-Furness District",
        "Gross Salary": "74 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "SC Clearance Required",
        "Posted Date": "2023-07-21",
        "Job Reference": "221763STE",
        "Sector": "Engineering",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Steve Roberts",
        "Recruiter Email": "Steve.Roberts@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/principal-systems-engineer-avc-test-capability"
    },
    {
        "Job Title": "CNC Machinist",
        "Job Description": "Machining Technician (CNC / Manual) Location: Peterborough Duration: 12 month rolling contract Hourly Rate: £18.96 PAYE Hours: 37.5 Monday to Friday (days) We are recruiting for X2 Machinists for a Manufacturing company based in Peterborough. The roles are offered on a rolling 12 month contract basis. You will be working on manual and CNC machines to produce components to be involved in prototyping, design and development of new systems and products To be considered, you will need: Good PC skills, including Microsoft Office, emails etc Some previous experience in programming / CNC Machining (ideally Haas or Mazak) is desired but not essential Previous experience operating conventional Lathes, Milling machines, Grinding, Boring machines and or CNC programming / operating Previous experience in using measuring equipment, including vernier callipers depth and thread gauges to name a few Ability to read and interpret engineering drawings Applicants must be self-motivated with good team working skills and be willing to work shifts if needed, (Currently no shift work in the area). Initiative, problem solving and positive attitude to change are also essential. Apprenticeship / City & Guilds / NVQ Level 3 in Machining or equivalent qualifications Previous experience at work coordinating or Leadership Experience The role offers the following package: Hourly rate of £18.96 per hour 37.5 hour standard working week (early finish Friday) 33 days holiday entitlement Pension Scheme On site canteen On site parking",
        "Job Location": "Peterborough",
        "Gross Salary": "18 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-21",
        "Job Reference": "221758MLS",
        "Sector": "Manufacturing & Utilities",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Michael  Lomas",
        "Recruiter Email": "Michael.Lomas@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/cnc-machinist-69"
    },
    {
        "Job Title": "People Services Advisor",
        "Job Description": "*Remote working with access to Manchester office* *Inside IR35* *6 month contract* Responsible for delivering a timely, high quality employment relations advisory service to the business. Whilst supporting the delivery of the People Services UK&I People plan, improvement of employee experience, and interventions to help the business achieve its strategic objectives. • A generalist HR background and a proven track record of delivering. • Strong employee relations experience gained in high volume, transactional environments with complex disciplinary, grievance, performance management and sickness absence management cases. • Excellent communication skills and ability to build solid working relationships. • Exposure to diverse and complex matrix businesses in an HR generalist role is an advantage. • Experience of working within a HR Shared Services & Centres of Excellence model is an advantage. • Experience of managing multiple ER cases at the same time. • Capacity to understand how people issues impact the business and how HR can create value for the business. • Ability to provide both verbal and written information clearly, succinctly, and persuasively, as well as ability to influence others. • Strong organisation skills are important, as well as strong attention to detail, an ability to multi task and see work through to full implementation. • Ability to adapt in a changing environment. • Ability to use research methods effectively, including data collection, diagnostic, and analytical skills. • Good working knowledge of employment laws and practices. • CIPD qualified or working towards chartership.",
        "Job Location": "Manchester",
        "Gross Salary": "27 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Remote",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-21",
        "Job Reference": "221756PSD",
        "Sector": "Consulting & Corporate Strategy",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Paul Stroud",
        "Recruiter Email": "Paul.Stroud@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/people-services-advisor"
    },
    {
        "Job Title": "Manufacturing Engineer Configuration Mgt",
        "Job Description": "Configuration Management Support Engineer Location: Filton on-site Duration: 6 Months Rate: £27.56 PAYE Responsible for the ME and Configuration Management activities in accordance with Program requirements. To define and work in line with the Configuration Management Plan agreed by GKN & Clients/Suppliers. Key Responsibilities Responsible for the programme Change Management process to ensure all change is tracked, monitored, visualised, and incorporated into baselines, in line with agreed points of embodiment to customer requirements. Coordinates the interaction between engineering, manufacturing, supply chain, operations, and program management to ensure appropriate changes are documented and approved, in line with all Export Control/ITAR requirements. Ensures the maintenance and timely release of configuration baselines and records. Collates and reviews change impact assessments to prepare for internal/customer Change Control Boards (CCB’s) Responsible for managing the Change Implementation Board (CIB) and Change Control Boards (CCB's), including the creation of Change Paperwork. Works in accordance with customer Configuration Management (CM) Plan ensuring compliance and flow down of CM requirements to sub-tier suppliers Supports all tasks associated with both Configuration and Data management i.e., Administration of Internal and External databases. Supports Modification planning activities and Condition of Supply (COS) creation. Validate that all change documentation is clear, concise, valid, and has been executed correctly and the to-be released documents matches the intent of the change. Application of Lean tools to business processes i.e., Visual Management, Scorecard, Root Cause Analysis, KPI’s etc. Completion of periodic CM audits (PCA) and Configuration Status Accounting (CSA) activities, in line with programme requirements. Specific Functional Capability, Knowledge and Skills Required Essential Knowledge of and application of principles, practices applicable to ISO10007 and AS9100 standards Clear understanding of applied Configuration Management in Aerospace environment Highly proficient in the use of all MS Office Suite applications Proficient in the use of Product Data Management (PDM) applications (Windchill preferred) Knowledge of product change management in complex organizations Proven Ability with CM process audits Must able to comply with Export Control and Nationality ITAR requirements Working knowledge of SAP, Windchill and Database packages. CAD Interrogator (CATIA V5 and V6) Document Management experience Desirable Knowledge of Configuration Management model (CMII) DOA / POA knowledge (EASA Part 21 Sub-part J & G). Strong minded and committed, able to embody vision and engage people in the delivery of that vision Project management experience Export Classification Engineer Certification (ECE) INDTNMI02",
        "Job Location": "Bristol",
        "Gross Salary": "27 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-20",
        "Job Reference": "221584DFA",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Daniel Farrow",
        "Recruiter Email": "Daniel.Farrow@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/manufacturing-engineer-configuration-mgt"
    },
    {
        "Job Title": "Business Operations Support",
        "Job Description": "Business Operations Support 18 Months Filton £13.60/hr PAYE + Holidays Inside IR35 Morson Talent are looking for a business operations support to join one of our leading aerospace clients. IYU Fuel Systems is an exciting, friendly and rapidly growing domain. To ensure we are delivering for the company in the best way possible there is an ever greater emphasis on efficiency and cost effectiveness. The Business Operations Manager is now therefore looking for someone to work alongside them to support both day to day activities as well as strategic business improvements. Role Responsibilities • Day to day administration of the subcontract process, including but not limited to… • Supporting Performance review meetings • Ensuring tasking documents are compliant with sub contract rules • Raising POs in the click and buy tool • Maintaining subcontract tracker. • Following up on late commitment and work package scope changes. • Working with the Domain Program Leaders and Work Package Leaders. • Working with the supplier. • Processing any Change Requests and updated ECMs. • Ensuring data is up to date ahead of the IYU Business Review and MBR. • Support the development of a subcontract forward looking plan. • Assist with business improvement initiatives to ensure harmonization and efficiency of Processes Typical Knowledge, Skills and Qualification Requirements • Keen and self-motivated • Comfortable using MS Excel and or Google Sheets. • Tables, Charts and Pivot Tables. • Comfortable using MS PowerPoint or Google Slides. • Well organized and logical approach. • Good attention to detail. • Some experience of supplier management would be helpful. Morson is acting as an employment business in relation to this vacancy. Administration; filing; e-filing; GDPR; secretarial; data entry; data input; Excel; Word; Outlook; Access; MS Office; booking system; business support; database management; diary management; minute taking; INDTNMI02",
        "Job Location": "Filton",
        "Gross Salary": "13 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "18 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-20",
        "Job Reference": "221716JMT",
        "Sector": "Office & Administration",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Jennifer MItchell",
        "Recruiter Email": "Jennifer.Mitchell@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/business-operations-support"
    },
    {
        "Job Title": "Project Procurement Officer",
        "Job Description": "The Role What are they actually doing day to day / average week? Overview of business area /department /function /programme BAE Systems is building eight new frigates for the Royal Navy and must make sure the ships are ready for service when handed over. The Type 26 Support team is preparing the support artefacts to ensure ships staff and support staff have everything they need to maintain and repair the ships when in service. It is critical that the Navy has the spare parts required to maintain and repair ships ready when required and the Project Management Professional will assist with the procurement of equipment through the ERP system. Assisting in the procurement of equipment Ensuring the integrity of data Ensuring governance is followed Assisting project manager with the delivery of projects Experience of ERP system, preferably SAP Ability to work unsupervised  Highly organised Good communication skills Knowledge of project management principles Non-Complex project reporting Non-Complex project scheduling Intermediate problem solving At this level the incumbent will be expected to work independently on routine aspects of the activity, and under guidance and supervision in more complex situations. They are unlikely to be directly supervising other staff. They would have a level of knowledge in one or more areas of project management practice and be expected to apply in routine circumstances and to seek and follow guidance on their adaptation and application in more complex circumstances. INTOTNM102",
        "Job Location": "Portsmouth",
        "Gross Salary": "26 PER HOUR",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-20",
        "Job Reference": "221744CMN",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Carl  Mawson",
        "Recruiter Email": "Carl.Mawson@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/project-procurement-officer"
    },
    {
        "Job Title": "Part time admin",
        "Job Description": "Part Time Admin 4 Months Filton £13.60/hr PAYE + Holidays Inside IR35 Morson Talent are looking for a part time admin to join one of our leading aerospace clients. This role will report to the Head of Fuel and Inerting Domain. The role however will be primarily focused on generic administration support to the domain’s engineering teams (circa 150 staff). The core purpose of the role is to assure certain key aspects of business administration are completed effectively and in line with the teams needs. The successful candidate will also interface and have guidance from an established senior administrator who currently supports the senior management team. Role Responsibilities • Diary management of key stakeholders within the domains • Visitor booking utilising the U Visit tool and escorting visitors across the site • Travel booking and expenses for specific needs and over time be the focal point for complex and challenging scenarios • Organising large meetings for the teams and coordinating diaries to enable successful events, inclusive of catering etc • Management of stocks - inclusive of but not limited to stationary, tea, coffee, milk with the ability to audit and purchase new goods through internal tool sets • Maintenance of Fuel and Inerting distribution lists and support VIP visits as required • The ability to provide direct support for activities such as memo’s, letters, meeting minutes, filing, archiving etc • Provide support to the procurement of key items utilising the internal tools and processes • Performing DSE Assessments for those requiring desk modifications. Typical Knowledge, Skills and Qualification Requirements Essential: • Experienced in working with large teams and the ability to adapt to changing environments • Excellent organisational skills • A proven track record of modern administration techniques, using multiple communication tools • Competent at delivering oral and written communications to teams and comfortable to interface with staff at all levels • Able to analyse and synthesise information from multiple sources Desirable: • Have a “can do” attitude and want to succeed • Be personable and approachable • Ability to challenge the status quo and propose alternative approaches where applicable Morson is acting as an employment business in relation to this vacancy. Administration; filing; e-filing; GDPR; secretarial; data entry; data input; Excel; Word; Outlook; Access; MS Office; booking system; business support; database management; diary management; minute taking; INDTNMI02",
        "Job Location": "Filton",
        "Gross Salary": "13 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "4 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-20",
        "Job Reference": "221717JMT",
        "Sector": "Office & Administration",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Jennifer MItchell",
        "Recruiter Email": "Jennifer.Mitchell@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/part-time-admin"
    },
    {
        "Job Title": "IVVQ Engineer",
        "Job Description": "Integration and Validation Engineer Location: Crawley/Remote (2 days a week on site) Duration: 6 Months Rate: £450.00 per day (Outside IR35) Our Crawley based client has an opportunity for a IVVQ Engineer to join the team on an initial 6 month contract basis. The Integration and Validation team are responsible for ensuring that product are fit for service and the installation at the customer sites. Responsibilities • Verifying and Validating Product Enhancements and Problem Reports raised as part of the product enhancement roadmap or issues discovered during testing • Continuous Product Testing as part of the product release drumbeatInstallation of software and integration of sources • Supporting live systems via telephone and VPN customer assistance, issue investigation and warranty visits • Working closely with Systems to ensure the operational needs of the customer are met • Setting up the system with the Hardware team to ensure the customer systems are ready for Factory and Site Acceptance • Setting up customer software both in factory and on-site • Creating customer releases, installation medium and site documentation (test plans, transition plans, version description documents) • Setting up the reference rig with the software releases provided by Software • Generating Product Test Procedures and Results plus contributing to the product Operating Handbooks and requirements set • Raising issues in the configuration management tool and owning them throughout their lifecycle • Carrying out the process improvement activities such as automated testing introduction and The Individual • A Team Player willing to help out the other disciplines (Hardware, Software and Systems Engineering) where necessary • Experience deploying systems involving Linux, Routers and external sources (ideally air traffic surveillance sources such as Radars, AFTN/AMHS interfaces, ADS-B interfaces) • Calm under pressure, methodical and with a grasp of configuration management • Good level of self-organization and ability to manage multiple tasks at once, good written and oral English • Willingess to travel (fundamental for the Integration role, limited travel for the Validation engineer) • An understanding of requirements and configuration management, aeronautical Software and Hardware standard (e.g. DO-278) and Air Traffic Control would be ideal but not essential • Knowledge of ADA / C / C++ / Java programming languages would be beneficial but not essential Interested? - Hit Apply",
        "Job Location": "Crawley",
        "Gross Salary": "450 PER DAY",
        "Payroll Status": "Outside iR35",
        "Location Type": "Remote",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-20",
        "Job Reference": "221576JTR",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Jonathan Tranter",
        "Recruiter Email": "Jonathan.Tranter@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/ivvq-engineer-4"
    },
    {
        "Job Title": "AWS Architect",
        "Job Description": "AWS Architect / AWS Engineer - Contract (6 months initially) - Remote with occasional trips to London - IR35 status (TBC) Our client is searching for experienced candidates for the position of AWS Architect/Engineer. Please review the list of responsibilities and qualifications. While this is our ideal list, we will consider candidates that do not necessarily have all of the qualifications but have sufficient experience and talent. Experience for AWS Architect/Engineer • Minimum 10 years’ experience working in a commercial IT environment. • Knowledge of Windows 2019, Active Directory and Linux platforms. • Detailed knowledge of implementation Security groups and Virtual Private Clouds within an AWS environment. • Minimum 3 years of progressive and relevant experience in AWS Architect/Engineer. • 2 years’ experience in Cloud Formation Stack process and procedures, including developing and maintaining Infrastructure as Code • Knowledge of Secure Coding techniques. • Experience of working on projects delivering PCI DSS 3.2.1 compliance • Experience of appropriate Cyber Security “best practice” compliance process and control within an AWS PAS environment, including Guard Duty, Security Hub, TrendMicro and Tenable.",
        "Job Location": "England",
        "Gross Salary": "650 PER DAY",
        "Payroll Status": "Inside iR35",
        "Location Type": "Remote",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-20",
        "Job Reference": "221735ALX",
        "Sector": "IT",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Alex McQuade",
        "Recruiter Email": "Alex.McQuade@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/aws-architect-5"
    },
    {
        "Job Title": "Comms Engagement & Event Executive",
        "Job Description": "Morson Talent are partnering with a well-established innovative utilities organisation; and are on the look out for a Marketing professional who is passionate about creative and engaging content but knowledgeable on effective internal/external communication publications. You will be part of a company that values employee well-being, and also have been recognised in the media as a \"Employer of the Year\". The role is a Comms Engagement & Events Executive, based in Elephant & Castle, will working within the Connections team. Reporting to the Head of Delivery, you will be responsible for creating relevant written topics related to the team and the purpose is to increase awareness across internal and external channels. Responsibilities: To plan, design and deliver the Connections marketing communications programme. To produce and publish key regulatory publications. To plan, design and deliver the Connections internal communications programme. To manage and develop the Connections and relevant Network Operations internet pages. To support internal teams on network events. Skills & Experience: Demonstrable experience of working within a marketing and/or communications function. Experience in creating marketing publication in a B2B space. Ability to influence and persuade at all levels. Strong organisational and project management skills. Excellent written and verbal communication skills with an eye for accuracy and consistency. Results orientated, pro-active, enthusiastic approach and resilience under pressure. Energetic, strong team player. Excellent IT skills. What's on offer? £200+ Day Rate via Umbrella. 12-month contract. Hybrid-working model (min 3 days onsite). Entry to long-term career opportunities. INDTNMI80",
        "Job Location": "London",
        "Gross Salary": "300 PER DAY",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Hybrid",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-20",
        "Job Reference": "219515BSK",
        "Sector": "Marketing, Advertising & PR",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Bradley Skolozdra",
        "Recruiter Email": "Bradley.Skolozdra@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/comms-engagement-and-event-executive"
    },
    {
        "Job Title": "Commercial Support Officer",
        "Job Description": "Job Title: Commercial Support Officer Duration: Anticipated 12 months Standard Hours: 35 per week Other working hours information: Half day Fridays – the Flexi refers to the morning start time generally between 7am and 9.30am subject to Managers approval To support the day to day Commercial operation of the business and be responsible for the administration and activities associated with customer enquiries, the return of quotations, order receipt and management though to invoice clearance and overdue debt reduction. Process and support the company order book to reflect the customer purchase order requirements in a timely and professional manner. Facilitate the invoicing process and be responsible for overdue debt clearance (including direct liaison and management of overdue debt resolution with customers. Executes the agreed actions for improvements/ recoveries on claims and disputes including actions to align customer scorecards, in close collaboration with the responsible disciplines. Co-ordination of Commercial communication to and from internal and external customers. Ability to integrate with internal processes and departments to highlight commercial issues to the program. Support the interface with the business to highlight contractual obligations to its customers in order to avoid breach of such obligations. To support customer / change negotiations and implementation including analysis of data and pricing. Establishing and controlling robust document management in the IPT and towards/ from the customer. Shift Pattern: 4.5 Days Flexi Rate: Target £15.38 PAYE Location: GKN Filton (Airbus Single Aisle) INOTNM102",
        "Job Location": "Filton",
        "Gross Salary": "15 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-20",
        "Job Reference": "221632CMN",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Carl  Mawson",
        "Recruiter Email": "Carl.Mawson@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/commercial-support-officer-7"
    },
    {
        "Job Title": "Mechanical Draughtsman",
        "Job Description": "Our client is seeking a Mechanical Draughtsman for an on-going contract opportunity based in Grangemouth. Requirement The ideal candidate will be familiar and experienced in the following: Have an understanding of Hydraulic pressure testing procedures. Main Function: • Execute measurement on field for piping, vessels, exchangers, rotating equipment, foundations, structures, and generate drawings in autocad. • Implement these documents to permit the management of flow of technical information for the modifications Qualifications Minimum mechanical PDA-professional development awards- (level 6 of Scottish credit and qualification framework), preferable mechanical HNC (level 7 of Scottish credit and qualification framework), with at some experience within a top tier COMAH site, under permit to work procedure. AUTOCAD and “isometric/constructive drawings preparation” experience is essential Computer literate with Word, Excel, Microsoft project, SAP (Experience of CMMS).",
        "Job Location": "Grangemouth",
        "Gross Salary": "37 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-20",
        "Job Reference": "221732GC2",
        "Sector": "Manufacturing & Utilities",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Gordon Clark",
        "Recruiter Email": "gordon.clark@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/mechanical-draughtsman"
    },
    {
        "Job Title": "Planner",
        "Job Description": "Morson Talent are recruiting for P6 Planners to join one of our consultancies based in York 1 day per week for 12 months to work on a large Rail project. Duties Include: Planner role managing and updating the design programme in p6. Design planning 2,000+ activities Reporting of progress and status of the programme, utilising coding and filtering techniques to tailor reporting to user requirements, Baseline Maintenance (Master Deliverable List) Design Deliverable to Schedule Mapping Progress and Reporting (Including Narrative) Assisting Forecast Final Cost and Schedule Alignment Assisting Internal Interface Management between Design Work Packages Support the package management team with analysing the plan from a risk perspective, highlighting high critical pinch points Knowledge & Experience: Rail Experience preferred Good written and oral communication skills, including the ability to liaise with peers and immediate seniors and build relationships, A logical approach and ability to think through complex issues, Self-motivated and proactive, with the ability to work under broad direction, Proficiency with desktop applications (e.g. MS Word, Excel, and PowerPoint) Proficiency in using common planning software, namely P6. INDTNMI42",
        "Job Location": "United Kingdom",
        "Gross Salary": "550 PER DAY",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-20",
        "Job Reference": "221695IMM",
        "Sector": "Transport & Logistics",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Isabel Morgan-Meade",
        "Recruiter Email": "Isabel.Morgan-Meade@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/planner-60"
    },
    {
        "Job Title": "Procurement Manager",
        "Job Description": "Morson is delighted to be working in partnership with a market leading Defence organisation, to recruit a Procurement Manager for an initial 5 month duration (an extension is expected). The role will involve a hybrid working arrangement with a split between 2-3 days a week working from home 2-3 days a week being onsite in Templecombe. As the role has been deemed Inside IR35, we can offer a rate of £450- £550 Per Day Umbrella for the successful candidate. Primary Purpose of the Role: To represent Procurement as an integral part of a campaign, Bid or Product or Project team, leading the resources of the function in order to optimise it’s contribution to producing competitive campaigns, bids and products, and delivering profitable projects. Work with internal stakeholders to ensure Acquisition or Sourcing strategies for a campaign, bid, or product or project are aligned to the needs of the business in the short, medium and long term durations. Work with the bid and product development teams to ascertain the work package needs, competitiveness objectives and target costs. Develop a supply chain architecture negotiate with the supply chain, under these mandates, to obtain a complete and competitive supply chain architecture which delivers the full requirement of the bid/product. Deliver a risk managed set of Terms and Conditions of contract for all elements of the supply chain. In project phase, work closely with key stakeholders and functions as necessary, to manage all Procurement aspects ensuring work packages are executed in accordance with technical, program, cost and performance (quality and delivery) requirements. Work in compliance with the Manage Project process. Although the role maybe assigned to a particular business or location, the job holder may be requested to support the function’s activities in other businesses or locations across the UK. In most regards this role equates to the Acquisition Project Manager as defined in Chorus 2. Key Responsibilities and Tasks: • Be seen as the lead Supply Chain architect for the assigned campaign, bid or project • As a result, create, agree, maintain all governance requirements and Acquisition Strategy and Plan with the bid/project team • Produce and agree the Purchasing Executive Summary • Work with multiple stakeholders to design the supply chain architecture to meet needs of the bid or product • Play a key role in defining and implementing strategies to meet the offset/industrial participation needs of the business where appropriate • Generate/ review RFQs, ensuring bid and program requirements are accurately captured • Ensure that the RFQ and contract packs are complete and agreed with stakeholders • Establish and maintain the Purchasing Summary Sheet (PSS) and other governance requirements • Allocate Work Packages accurately and on time to the relevant functional resources whether in UK Procurement Competency Centres or in the CBU. • Confirm tailoring and Purchase vet planning. • Facilitate both strategic and tactical the Make, Team, Buy process in line with medium term industrial plan for the business line • Lead the activities of the Procurement function to identify supply market innovation opportunities, involving suppliers in design upstream and optimizing risk-sharing • Identify and mitigate risks and maximize opportunities in the role of Procurement Risk Manager for the bid. • Undertake commercial and contractual tasks at all times, including engaging with commercial teams to define suitable terms and conditions. • Ensure effectiveness by employing suitable reporting, tracking and performance management tools and techniques and represent Procurement at Bid reviews. • Co-ordinate the activity of all Procurement resources in support of the bid ensuring timely responses. • Record and report Upstream Price Decrease UPD Savings • Commit to Procurement performance in the bid including bought in costs, delivery/leadtimes, quality, resource management, cash-flow, risks and opportunities. • Create and provide accurate Procurement estimates, covering resource labour, material and Total Cost of Ownership to the bid team • Recognise export controls associated with supply chain architecture and program requirements including: ITAR(TAAs(& TCPs)/MLAs) EAR ECCN,UK & foreign Military and Dual-Use Controls • At all times understand and maximise the company’s commercial position with the supply chain Skills Essential • Commercially astute with advanced negotiation skills and experience including differing contracting models • Broad range of Procurement skills focused on: Needs Analysis, Design to Cost, Make-Team-Buy, Technical Interface Management, Acquisition Strategy definition, International Sourcing, Supplier Management, Risk and Opportunity Management, Subcontract Management. • Leadership, presentation and communication skills • Exceptional Interpersonal skills to optimise cross-functional & cross-organisational working, engage key stakeholders and to work effectively with suppliers. • Negotiation skills in a complex systems’ environment • Analytical skills • Commercially astute with advanced negotiation skills and experience including differing contracting models • Well-developed organisational skills Desirable • Team management, leadership and team development • Major development/manufacture sub-contract program/project management experience • Broad technical and commercial understanding of the company product and associated bought in supplied parts and services • Ability to lead Make, Team, Buy decisions • Upstream purchasing techniques deployment, especially Co-Development, Co-Engineering, Value Engineering, Value Analysis, Functional Analysis, Cost Analysis. Qualifications: Essential • MCIPS, degree or equivalent qualifications in other commercial or project management disciplines Desirable - Already studying towards MCIPS or Business Degree/Qualification or equivalent or willingness to do so - Business or Engineering degree, or equivalent - Professional qualification in related disciplines eg Project Management, Engineering, Supply Chain Simply hit the 'Apply Now' button for immediate consideration. INDTNMI02",
        "Job Location": "Somerset",
        "Gross Salary": "550 PER DAY",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Hybrid",
        "Assignment Length": "5 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-19",
        "Job Reference": "216030JSR",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "John Sadler",
        "Recruiter Email": "john.sadler@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/procurement-manager-81"
    },
    {
        "Job Title": "Procurement Manager",
        "Job Description": "Morson is delighted to be working in partnership with a market leading Defence organisation, to recruit a Procurement Manager for an initial 5 month duration (an extension is expected). The role will involve a hybrid working arrangement with a split between 2-3 days a week working from home 2-3 days a week being onsite in Cheadle. As the role has been deemed Inside IR35, we can offer a rate of £450- £550 Per Day Umbrella for the successful candidate. Primary Purpose of the Role: To represent Procurement as an integral part of a campaign, Bid or Product or Project team, leading the resources of the function in order to optimise it’s contribution to producing competitive campaigns, bids and products, and delivering profitable projects. Work with internal stakeholders to ensure Acquisition or Sourcing strategies for a campaign, bid, or product or project are aligned to the needs of the business in the short, medium and long term durations. Work with the bid and product development teams to ascertain the work package needs, competitiveness objectives and target costs. Develop a supply chain architecture negotiate with the supply chain, under these mandates, to obtain a complete and competitive supply chain architecture which delivers the full requirement of the bid/product. Deliver a risk managed set of Terms and Conditions of contract for all elements of the supply chain. In project phase, work closely with key stakeholders and functions as necessary, to manage all Procurement aspects ensuring work packages are executed in accordance with technical, program, cost and performance (quality and delivery) requirements. Work in compliance with the Manage Project process. Although the role maybe assigned to a particular business or location, the job holder may be requested to support the function’s activities in other businesses or locations across the UK. In most regards this role equates to the Acquisition Project Manager as defined in Chorus 2. Key Responsibilities and Tasks: • Be seen as the lead Supply Chain architect for the assigned campaign, bid or project • As a result, create, agree, maintain all governance requirements and Acquisition Strategy and Plan with the bid/project team • Produce and agree the Purchasing Executive Summary • Work with multiple stakeholders to design the supply chain architecture to meet needs of the bid or product • Play a key role in defining and implementing strategies to meet the offset/industrial participation needs of the business where appropriate • Generate/ review RFQs, ensuring bid and program requirements are accurately captured • Ensure that the RFQ and contract packs are complete and agreed with stakeholders • Establish and maintain the Purchasing Summary Sheet (PSS) and other governance requirements • Allocate Work Packages accurately and on time to the relevant functional resources whether in UK Procurement Competency Centres or in the CBU. • Confirm tailoring and Purchase vet planning. • Facilitate both strategic and tactical the Make, Team, Buy process in line with medium term industrial plan for the business line • Lead the activities of the Procurement function to identify supply market innovation opportunities, involving suppliers in design upstream and optimizing risk-sharing • Identify and mitigate risks and maximize opportunities in the role of Procurement Risk Manager for the bid. • Undertake commercial and contractual tasks at all times, including engaging with commercial teams to define suitable terms and conditions. • Ensure effectiveness by employing suitable reporting, tracking and performance management tools and techniques and represent Procurement at Bid reviews. • Co-ordinate the activity of all Procurement resources in support of the bid ensuring timely responses. • Record and report Upstream Price Decrease UPD Savings • Commit to Procurement performance in the bid including bought in costs, delivery/leadtimes, quality, resource management, cash-flow, risks and opportunities. • Create and provide accurate Procurement estimates, covering resource labour, material and Total Cost of Ownership to the bid team • Recognise export controls associated with supply chain architecture and program requirements including: ITAR(TAAs(& TCPs)/MLAs) EAR ECCN,UK & foreign Military and Dual-Use Controls • At all times understand and maximise the company’s commercial position with the supply chain Skills Essential • Commercially astute with advanced negotiation skills and experience including differing contracting models • Broad range of Procurement skills focused on: Needs Analysis, Design to Cost, Make-Team-Buy, Technical Interface Management, Acquisition Strategy definition, International Sourcing, Supplier Management, Risk and Opportunity Management, Subcontract Management. • Leadership, presentation and communication skills • Exceptional Interpersonal skills to optimise cross-functional & cross-organisational working, engage key stakeholders and to work effectively with suppliers. • Negotiation skills in a complex systems’ environment • Analytical skills • Commercially astute with advanced negotiation skills and experience including differing contracting models • Well-developed organisational skills Desirable • Team management, leadership and team development • Major development/manufacture sub-contract program/project management experience • Broad technical and commercial understanding of the company product and associated bought in supplied parts and services • Ability to lead Make, Team, Buy decisions • Upstream purchasing techniques deployment, especially Co-Development, Co-Engineering, Value Engineering, Value Analysis, Functional Analysis, Cost Analysis. Qualifications: Essential • MCIPS, degree or equivalent qualifications in other commercial or project management disciplines Desirable - Already studying towards MCIPS or Business Degree/Qualification or equivalent or willingness to do so - Business or Engineering degree, or equivalent - Professional qualification in related disciplines eg Project Management, Engineering, Supply Chain Simply hit the 'Apply Now' button for immediate consideration. INDTNMI02",
        "Job Location": "Cheadle",
        "Gross Salary": "550 PER DAY",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Hybrid",
        "Assignment Length": "5 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-19",
        "Job Reference": "216028JSR",
        "Sector": "Aerospace",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "John Sadler",
        "Recruiter Email": "john.sadler@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/procurement-manager-80"
    },
    {
        "Job Title": "Commercial Project Director",
        "Job Description": "Role: Commercial Project Director Location: Europe & Taiwan (Rotation) Duration: 12 - 18 months Contract Rate: €1300 - €1500 per day + add ons My client is a global developer and operator of offshore wind farms present in over 30 countries globally. They currently have a project pipeline of 20GW globally making them a market leader within the Offshore Wind industry. They are now looking to recruit a Commercial Project Director to help support their continued growth. Responsibilities: • Reports to the Project Director and is together with the EPC Project Director an integral part of the senior project leadership assigned to ensure development and execution of the project most efficiently and effectively. • Driving commercial management of the project, coordinating, and supervising the project’s commercial functions ensuring that budgets, as well as business case assumptions/targets are defined, robust, progressing and achieved. Ensuring informed and objective decision making. • Leading and managing functional teams and subject matter experts • Internal and external stakeholder management Tasks: • Lead BC and budgeting development and control processes (from input to quality assurance to change management) • Implementing adequate controls, monitoring, and regular reporting of key project financial/commercial information. • Overseeing and coordinating the following areas: non-EPC procurement, risk, controlling, claims, legal, project finance, power purchase agreements, valuation, customs, and tax • Interfacing with Partnering, JV Management, Investor Relations • Being the commercial sparring partner for the Project Director and the EPC Director Qualifications: • Proven track record in dealing with business critical, commercial, highly complex objectives and challenges, preferably from offshore wind and an international organisation. • Energetic, communicative, and inspiring/convincing leader able to focus on both business and people. Experience from working globally across different cultures is preferred. • Integrity, commercial acumen, analytics, integration, and communication skills • People leadership and project management skills • Full proficiency in English and Microsoft suite INDTNMI52",
        "Job Location": "Hamburg",
        "Gross Salary": "1300 PER DAY",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "18 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-19",
        "Job Reference": "219615DL1",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Daniela Lara",
        "Recruiter Email": "Daniela.Lara@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/commercial-project-director-2"
    },
    {
        "Job Title": "EC&I Engineer",
        "Job Description": "EC&I Engineer The Opportunity: We are recruiting for an EC&I Engineer to join our Clients Delivery team at Hinkley Point B Nuclear Power Station. You will be part of a client lead team focusing on preparing station as it moves from generation into the next phase of life. This next defueling phase will take place over a number of years and is critical to station before finally moving into decommissioning. EC&I Engineer will report to the Site Lead but be directly accountable to the client for successful delivery of all aspects of their assigned projects. Predominantly based at Hinkley Point B Power Station there may be a requirement for occasional business travel to other UK sites/stations as required. The Person: • Electrical bias preferred but multidiscipline experience will be considered • Experience of working within a highly regulated industry (for example nuclear, aviation) is preferred but not essential. • Experience of identifying, implementing and complying with applicable safety, environmental and quality standards, company procedures and policies and all site based legislative requirements. • Perform feasibility studies, site surveys and liaise with station engineering staff to identify scope of works required. • Capable of producing from scratch or amending existing engineering documentation such as electrical drawings, quality plans, installation method statements. In addition to this there will be a requirement to review and approve contractor WRAMS. • Have good leadership skills and experience with supervising contractors during project installation phases. Acting as installation team leader where necessary. • Have a strong Health and Safety culture able to lead by example and provide coaching where necessary. Experience in creating Task Risk Assessments. • Able to produce a turnkey package of work (Documentation, Install Supervision, testing and sign off to the client once complete) • Flexibility with paid extended working hours (and weekends) will be required to fit in with site process (mainly during installation phases) sometimes at short notice. • Carry out secondary roles as required by the Cavendish Site Lead. (Radiological Protection Supervisor, PUWER Assessor). Training will be supplied as required. Qualifications: HNC in relevant engineering discipline Demonstrative experience within previous similar roles. Basic IT skills (Word, Excel)",
        "Job Location": "Somerset",
        "Gross Salary": "50 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-19",
        "Job Reference": "221248ZB",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Zaida Bhana",
        "Recruiter Email": "zaida.bhana@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/ec-and-i-engineer-67"
    },
    {
        "Job Title": "Ecological Clerk of Works",
        "Job Description": "Our client SP Energy Networks are currently recruiting for an Ecological ECoW to join them on a long-term contract. The ECoW role is site based in the Dumfries and Galloway Area. The role involves monitoring the site-based construction and post construction restoration works. The role shall work with site personnel and a variety of 3rd Party stakeholders. ACCOUNTABILITIES • Production of and input to key construction phase documents, some of which are required for planning condition discharge during pre-construction phase, these may include. o The Construction Environmental Management Plan (CEMP) o Pollution prevention plans o Construction Method Statements o Permits to Work o Ecological constraints plan. o Habitat management Plans o Landscape Management Plans o Species Mitigation and management Plans • Attendance and input to site meetings • Proactively identify and resolve Ecological Issues. • Consult with Local planning Authorities, SEPA, Nature Scot and any other Environmental Stakeholder • Provision of Toolbox Talks • Protected species surveys • Ecological Watching brief as and when required. • Species translocation • Application and management of Protected Species Licences • Interpretation and management of the following topics o Private Water Supplies o GWDTEs o Peat Management Plans o Fish Monitoring Plans o Nightjar Monitoring o Bird Protection Plans • Provide monthly reports to the LPA • Reporting and Management of any Non-Compliances and Environmental Incidents SKILLS, KNOWLEDGE AND EXPERIENCE • Proven Ecological site Experience. • Working Knowledge of Wildlife legislation • Excellent communication and problem-solving skills. MINIMUM CRITERIA • Current valid driving licence • Willing to be site based and travel daily. • Experience in an ECoW within an engineering or construction related environment. • Computer Literacy & working knowledge of Microsoft Packages • Degree in an ecological discipline",
        "Job Location": "Dumfries and Galloway",
        "Gross Salary": "450 PER DAY",
        "Payroll Status": "Umbrella PAYE",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-19",
        "Job Reference": "221665LME",
        "Sector": "Construction & Civil Engineering",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Lisa Meikle",
        "Recruiter Email": "Lisa.Meikle@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/ecological-clerk-of-works-6"
    },
    {
        "Job Title": "P6 Project Planner Sizewell C",
        "Job Description": "We have an exciting opportunity to be part of the Sizewell C Ecology Mitigation works for a P6 Planner. The Schedulers will be utilising processes and tools (P6) to support the delivery of the Works including the overall master Plan and Project Specific schedules. Specific Responsibilities: • Engage with key stakeholders to create and maintain project schedules including baselines in order to feed logic driven milestone dates into the project management system (ePro) • Develop close working relationship with delivery teams and gain an understanding of the delivery requirements of projects • Attend meetings from initiation and throughout the lifecycle of the project And contribute towards effective project level scheduling • Own and maintain generic project templates used to augment project schedules and promote consistency, knowledge sharing and best practice • Deliver training as required • For larger projects (>£1m) ensure that relevant schedule reporting is delivered, including advising Programme Manager, customers and stakeholders of any schedule issues that may compromise a project. Use project and pipeline programmes to inform resource decision making • Create monthly resource profiles and heat map so as to understand resource utilization and identify opportunities for re-assignment to improve project completions across functions • Provide co-ordination and support in multi projects delivery and ensuring that the integrated master schedules are updated and any identified risk and opportunities are adequately communicated to stakeholders. • Liaises with the Leadership Team and Project Support Group to ensure appropriate support in place to enable successful delivery Specific experience: • P6 • Excel • Knowledge of key project management processes e.g. CPA, EVM. This will be a contract role initially for 8 months. 40 hours per week. This will be a mixture of working on site at Sizewell C and some working from home days. TNINDMI07",
        "Job Location": "Suffolk",
        "Gross Salary": "48 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "8 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-19",
        "Job Reference": "221663ZLO",
        "Sector": "Engineering",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Zoe Loveridge",
        "Recruiter Email": "Zoe.Loveridge@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/p6-project-planner-sizewell-c-3"
    },
    {
        "Job Title": "Area Integration Lead",
        "Job Description": "We are currently recruiting for an Area Integration Lead to work on a large construction site in Somerset. This is a contract role and will be a mixture of site based and home working. The Area Integration Lead will be a staunch advocate of our Safety Culture and help to embed this approach in all processes and activities undertaken on the project. The Area Integration Lead will ensure that there is a recommended sequence of installation of all scope across multiple contracts within their designated area from manufacturing completion through to site construction, erection and commissioning which supports schedule integration. This will involve: - conducting integrated and cross-cutting coordination reviews of construction preparation, - looking at arrangements in detail from wider perspectives to provide oversight, - ensuring pre-requisites, dependencies and constraints are managed in a balanced and integrated approach to ensure the activities on the site run safely and smoothly and in accordance with the project schedule. The Area Integration Lead will have experience in planning and constructing complex construction projects to achieve the job purpose objectives by implementing, as a minimum, the following as appropriate for the work being performed: • Advocating safe and effective planning of works for site construction. • Ensuring that conventional and nuclear safety considerations are recognised as essential to the success of the project and built into the planning processes. • Ensuring that detailed plans are developed on a facility and/or area basis which integrate, co-ordinate and sequence work activities to achieve the optimum construction sequence, paying particular attention to several contractor interfaces. Including: o Equipment and bulk material introduction routing, equipment installation and material handling o Identification of Site Need Dates for equipment and materials o Supporting a coordinated and holistic approach to the provision of common shared services such as scaffold, temporary services and utilities, etc. o Recognising the importance of other supporting activities such as laydown areas, and work area coordination for activities such as housekeeping and work face storage. The Area Integration Lead will be required to use 3D and/or 4D tools, such as Navisworks and/or Synchro, and manage data via databases or PowerBI. Qualifications & Experience Essential • Degree in Civil, Mechanical or Electrical Engineering or Equivalent in Construction Management or related subject or a demonstrable level of experience based on years of experience (10 plus years) and project assignments. • 10 years’ experience in delivering highly complex projects. • Experience operating in a high security environment advantageous. • In-depth knowledge and experience of programme progress and forecast position and planning. • Strong communication skills in English required, knowledge of French can be an advantage.",
        "Job Location": "Bridgwater",
        "Gross Salary": "650 PER DAY",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "6 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-19",
        "Job Reference": "221662ZB",
        "Sector": "Construction & Civil Engineering",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Zaida Bhana",
        "Recruiter Email": "zaida.bhana@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/area-integration-lead-1"
    },
    {
        "Job Title": "Senior Robotic Systems Technologist",
        "Job Description": "We have an excellent opportunity for a SENIOR ROBOTIC SYSTEMS TECHNOLOGIST based in Cumbria with our Client who is a leading voice within the Nuclear industry. This is initially a 12 month position and can be worked on a hybrid basis, between home and office. JOB DESCRIPTION This role is based within the growing Robotics capability area to support the delivery of the Sellafield Ltd and NDA robotics strategy for accelerated decommissioning. This Robotic System Technologist will meet the SQEP requirements of RAI for Harsh Environments to lead work programmes from concept through to customer delivery. MAIN RESPONSIBILITIES Working with the customer to understand their business requirements for a robotic based solution, providing novel and innovative solutions. Design & Develop software to meet the customer requirements, following Company procedures for software development and ensuring the appropriate quality for the task Undertaking small and large-scale trials, involving proprietary and bespoke robotics hardware and test rig equipment. Ensure all work is undertaken safely, understanding the specific risks of working with robotics systems, and able to supervise work undertaken on the test rig equipment Ensure software implementations meet CS&IA requirements and that solutions follow best practice in cybersecurity. THE IDEAL CANDIDATE ESSENTIAL Software development experience in C++, Linux & Windows compliers Robotics development skills in KUKA Robot Language (KRL), KUKA Remote Sensor Interface (RSI), Beckhoff PLC programming and data communication engineering Good communication skills Experience of working to a formal Software development lifecycle process DESIRABLE Good understanding of the Nuclear industry Understanding of Programmable Electronic Systems (PES) requirements",
        "Job Location": "Cumbria",
        "Gross Salary": "510 PER DAY",
        "Payroll Status": "Inside iR35",
        "Location Type": "Hybrid",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-19",
        "Job Reference": "220701GJA",
        "Sector": "Energy, Mining, Oil & Gas",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Gillian James",
        "Recruiter Email": "Gillian.James@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/senior-robotic-systems-technologist-2"
    },
    {
        "Job Title": "Vehicle Technician",
        "Job Description": "Vehicle Technician Cranfield Monday – Friday £17.32ph (£35,200 p.a) We have several roles available for vehicle technicians to work within the testing team of our automotive client based in Cranfield. You be working for a globally recognised automotive company. Based at their design centre, you will assist engineers with the testing of new vehicle designs & prototypes. The vehicle technician role will initially be working on a contract basis for 12 months. This is likely to be extended for several years or become permanent. The role is based on site 5 days per week. We have opportunities available across several departments including: • Interior Trim Removal and refit of interior trim parts. Creation of prototype mock-up parts using, hand tools, 3D printing & milling. Completion of vehicle ergonomics analysis using 3D scanners & CMM measuring. • Electrical Test and validation of function, operation & reliability inc. Power Management, Harness, Body Electronics, Meter, Audio & Telephone. • Connected Car & Navigation Automotive electrical and electronic testing relating to HMI (Human Machine Interface), telematics, mobile phone applications, navigation & infotainment systems. • Crash Test Preparing and building of vehicles and components for crash testing in line with company procedures. • Vehicle Technician Assemble & dis-assemble parts, components or vehicles for static & dynamic test activities. Maintenance of Test Vehicle Fleet to include safety check, retrofit, fault finding & repair. All vehicle technician roles involve: • Preparation / building / maintenance of vehicles or components for test in line with local procedures. • Support Testing in static and dynamic conditions to gather accurate, timely, and quality test data/results. • Support Evaluation and concern identification including liaison with Test Engineer. • Support delivery of Key Performance Indicators for the section • Use skills to provide support to other sections as required Candidate requirements for the vehicle technician roles: • Fundamental understanding of vehicle dis-assembly, assembly, & maintenance techniques • Vehicle system knowledge with the ability to fault find • Understanding of component measurement techniques • Instrumentation set-up • Understanding of vehicle diagnostic tools • Data acquisition & Report writing • C&G / BTEC L3 would be preferred Hours & Pay for a vehicle technician: • Monday – Friday • 39 hours per week • Overtime & out of hours available – Additional pay • £17.32ph (Equivalent to £35,200 p.a) To apply for the role. Please forward your CV. LMIND",
        "Job Location": "Bedfordshire",
        "Gross Salary": "17 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "12 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-19",
        "Job Reference": "221466AM2",
        "Sector": "Automotive",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "Bhavna Kotecha",
        "Recruiter Email": "Bhavna.Kotecha@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/vehicle-technician-12"
    },
    {
        "Job Title": "Administrator",
        "Job Description": "Morson are currently recruiting for an Administrator based in Southwark for an initial 2 month period. Key Responsibilities Graduate FM administration support required for TFL, required until end of September. Able to travel to central London. Hours of work can be 8am - 4pm or 9-5pm with one of the days working from home Managing documentation and data entry related to the additional works team Supporting the development and implementation of Additional Works plans Assisting with supplier management and contract administration Collaborating with all stakeholders to ensure effective communication and problem solving. Pay rate advertised is £16 PAYE Key Skills Proficient in MS office, Word and Excel, power point Proactive attitude and willingness to learn and grow Knowledge of Facilities Management principles Please send CVs to john.kingham@morson.com INDTNMI51",
        "Job Location": "England",
        "Gross Salary": "16 PER HOUR",
        "Payroll Status": "Inside iR35",
        "Location Type": "Onsite",
        "Assignment Length": "2 months",
        "Security Clearance Status": "",
        "Posted Date": "2023-07-19",
        "Job Reference": "221631JKM",
        "Sector": "Office & Administration",
        "Recruitment Agency": "Morson",
        "Recruiter Name": "John Kingham",
        "Recruiter Email": "john.kingham@morson.com",
        "Logo URL": "https://images.app.goo.gl/iRrSMdME2D1A1b3d7",
        "Post URL": "https://www.morson.com/job/administrator-479"
    }
]